{"imageid": "n290131", "question": [{"query": "Is the busy man waiting for a bus?"}, {"query": "Who is waiting for the food truck that is not large?"}, {"query": "Who is sitting?"}, {"query": "Does the side walk have brown color?"}, {"query": "Do the bags made of plastic look white or black?"}, {"query": "Is there a large window or door?"}, {"query": "How big is the window the man is looking through?"}, {"query": "Is the bag on the bench black and small?"}, {"query": "Is the young man to the left or to the right of the bags near the bench?"}, {"query": "What is the sidewalk made of?"}, {"query": "What is that backpack on?"}, {"query": "What bag is to the right of the man that is looking through the window?"}, {"query": "Is the color of the menu the same as the food truck?"}, {"query": "Is the color of the backpack different than the sidewalk?"}, {"query": "Are there both a window and a door?"}, {"query": "Is the large backpack to the right or to the left of the man on the left side?"}, {"query": "Do you see benches near the bags that look white?"}]}
{"imageid": "n287600", "question": [{"query": "Is the ipod in front of the colorful book?"}, {"query": "Is the comfortable pillow above a bedspread?"}, {"query": "Are the wires on top of a bedspread?"}, {"query": "What is in front of the large pillow?"}, {"query": "Are the cords in front of a towel?"}, {"query": "How large is the bag made of plastic?"}, {"query": "Do both the comfortable pillow and the book that is not large have square shape?"}, {"query": "Is the colorful book to the right or to the left of the bag that is on top of the bedspread?"}, {"query": "Does the ipod to the right of the book have large size and black color?"}, {"query": "Is this a pillow or a towel?"}, {"query": "Does the pillow behind the other pillow have round shape and red color?"}, {"query": "Which shape is the ipod that is not big?"}, {"query": "What shape is the small book?"}, {"query": "The round pillow is of which color?"}, {"query": "What color is the pillow that is not uncomfortable?"}, {"query": "Do the wires in front of the pillow look black and long?"}, {"query": "Are the wires white or black?"}, {"query": "How big is the bedspread the wires are on top of?"}, {"query": "Is the bag made of plastic both orange and large?"}, {"query": "On which side of the image is the small device?"}, {"query": "What is common to the ipod and the bed spread?"}, {"query": "Is the small bag to the left or to the right of the book the ipod is in front of?"}, {"query": "Does the bag that is not big have orange color?"}, {"query": "What is the device that has the same shape as the bedspread underneath the pillow called?"}, {"query": "How large is the book on the left?"}, {"query": "What device is to the right of the colorful book?"}, {"query": "What is in front of the colorful book?"}, {"query": "What type of device is in front of the book which is to the left of the bag?"}, {"query": "What is that ipod in front of?"}, {"query": "What is underneath the comfortable pillow?"}, {"query": "Is the white pillow behind the wires soft and small?"}]}
{"imageid": "n26384", "question": [{"query": "Is the ski long and white?"}, {"query": "Is the snow white and hard?"}, {"query": "Is the large person to the right or to the left of the camera?"}, {"query": "Which color are the large boots?"}, {"query": "What does the small person wear?"}, {"query": "Which kind of device does the woman wear?"}, {"query": "Who is wearing the backpack?"}, {"query": "How large is the short person?"}, {"query": "On which side of the photo is the backpack?"}, {"query": "Do the boots look red and large?"}, {"query": "How large is the person to the right of the backpack?"}, {"query": "Is the tall person to the right or to the left of the person that is covered by the jacket?"}, {"query": "What does the woman used?"}, {"query": "Who uses the ski?"}, {"query": "What does the person in front of the mountain used?"}, {"query": "Do you think the woman that is to the right of the man is short or tall?"}, {"query": "What is the woman in front of?"}, {"query": "Is the man that is not small short or tall?"}, {"query": "Are the gloves purple?"}, {"query": "Who is the jacket covering?"}, {"query": "What is covering the small person?"}, {"query": "What is covering the woman?"}, {"query": "What is the ski made of?"}, {"query": "What is the ski that is not short made of?"}, {"query": "What's the woman covered by?"}, {"query": "Where is the snow?"}, {"query": "Is the large person to the left of the camera?"}, {"query": "What are the boots made of?"}, {"query": "Which material was used to make the boots, plastic or leather?"}, {"query": "Who wears a camera?"}, {"query": "Is the man to the left or to the right of the backpack on the left?"}, {"query": "Which side of the photo is the large person on?"}, {"query": "Are there any women in the image that are small?"}]}
{"imageid": "n405392", "question": [{"query": "What is stacked on the desk made of wood?"}, {"query": "Where is the man sitting?"}, {"query": "What is the name of the item of furniture that he is sitting at?"}, {"query": "What's he doing?"}, {"query": "Is the shirt that looks orange short sleeved or long sleeved?"}, {"query": "Does the shirt look long sleeved and green?"}, {"query": "What is the window made of?"}, {"query": "Where is this man sitting?"}, {"query": "Which kind of furniture is the man sitting at?"}, {"query": "Which kind of furniture are the books stacked on?"}, {"query": "Are there both glasses and ties in the image?"}, {"query": "On which side of the picture are the books?"}, {"query": "What hangs on the shirt?"}, {"query": "What do you think are the books stacked on?"}, {"query": "What is the man doing, staring or playing?"}, {"query": "Are there both a window and a door?"}, {"query": "Which color is the long sleeved shirt?"}, {"query": "What is in front of the person that wears glasses?"}, {"query": "What is in front of the man?"}, {"query": "Is the man behind the books that are shown in the picture?"}, {"query": "Is the tie red and thin?"}, {"query": "Does the red tie look thick or thin?"}]}
{"imageid": "n211003", "question": [{"query": "What is the woman in front of the dresser doing, waiting or talking?"}, {"query": "Is there any cell phone in this picture that is large?"}, {"query": "Which type of furniture is made of wood, the table or the dresser?"}, {"query": "Is the table small or large?"}, {"query": "What is located on top of the dresser?"}, {"query": "Which kind of furniture is to the left of the table?"}, {"query": "Are there any pictures next to the woman?"}, {"query": "What device is to the right of the wine bottle?"}, {"query": "Is there any woman that is talking?"}, {"query": "What is the name of the piece of furniture behind the person near the picture?"}, {"query": "What kind of furniture is behind the woman?"}, {"query": "The table is made of what material?"}, {"query": "What device is on top of the table?"}, {"query": "What is located on top of the long table?"}, {"query": "What kind of furniture is the woman in front of?"}, {"query": "Is the metal utensil on the left?"}, {"query": "How is the item of furniture that is to the right of the dresser called?"}, {"query": "The woman is in front of what?"}, {"query": "Is the woman to the left of the picture above the wine bottle?"}, {"query": "Does the fork look silver and metallic?"}, {"query": "Is the dresser tan and vintage?"}, {"query": "Is the paper napkin on the right or on the left?"}, {"query": "Who is in front of the dresser?"}, {"query": "What is the item of furniture that the woman is in front of?"}, {"query": "What's the woman in front of?"}, {"query": "Who is standing against the table?"}, {"query": "Who is standing against the long table?"}, {"query": "Do the wine bottle and the napkin have the same color?"}, {"query": "What is higher than the candle holder?"}, {"query": "What are the flowers higher than?"}, {"query": "What is located on top of the dresser that the wine bottle is to the right of?"}, {"query": "Are the green flowers on top of a dresser?"}, {"query": "Are the flowers on top of the dresser higher than the candle holder?"}, {"query": "What kind of furniture is not long?"}, {"query": "Is the wine bottle below the picture narrow and tall?"}, {"query": "What kind of furniture is to the left of the wine bottle?"}]}
{"imageid": "n103629", "question": [{"query": "Is the player to the left of the helmet old and Caucasian?"}, {"query": "Which color does the helmet in the top part have?"}, {"query": "Does the yellow jersey seem to be short sleeved?"}, {"query": "Who is wearing trousers?"}, {"query": "Is the player to the left of the helmet wearing a wristband?"}, {"query": "Is the black helmet to the right or to the left of the player that is wearing gloves?"}, {"query": "Who is wearing gloves?"}, {"query": "Who is wearing the gloves?"}, {"query": "Who wears a helmet?"}, {"query": "Who is crouching?"}, {"query": "Does the helmet to the right of the player look black?"}, {"query": "Is the helmet to the right of the player both hard and black?"}, {"query": "Does the player on top of the field look female and young?"}, {"query": "Who is wearing pants?"}, {"query": "Who uses the baseball mitt?"}, {"query": "Is the player that is to the left of the helmet female or male?"}, {"query": "Who is standing near the home plate?"}, {"query": "What does the player to the left of the helmet used?"}, {"query": "Does the player to the left of the helmet used a bat?"}, {"query": "Is the baseball bat made of metal?"}, {"query": "What is the baseball bat made of?"}]}
{"imageid": "n293460", "question": [{"query": "Is the bottle that is to the right of the other bottle full or empty?"}, {"query": "Does the water bottle look blue?"}, {"query": "Where is that cup kept in?"}, {"query": "Is the white cup to the right or to the left of the bottle that is not empty?"}, {"query": "Is the glass different in color than the cup?"}, {"query": "Is it an indoors or outdoors picture?"}, {"query": "Are there any bottles that are not open?"}, {"query": "Is the white cup on the right side of the photo?"}, {"query": "Is the glass clear and silver?"}, {"query": "What color is the dress the women are wearing?"}, {"query": "Is the bottle to the left of the other bottle made of plastic or glass?"}, {"query": "Do you see bottles to the left of the white object that is kept in the kitchen?"}, {"query": "Is the water bottle silver and empty?"}, {"query": "Who is wearing the dress?"}, {"query": "Who is wearing a dress?"}, {"query": "What are they wearing?"}, {"query": "Is the full bottle to the left or to the right of the cup?"}, {"query": "Is the glass bottle on the right side?"}, {"query": "On which side of the photo is the water bottle?"}, {"query": "Who is standing at the clean kitchen?"}, {"query": "What are the women wearing?"}, {"query": "What color does the glass have?"}, {"query": "Is the full bottle on the right or on the left?"}, {"query": "Does the full bottle look open and brown?"}, {"query": "Is the water bottle to the right of the women empty or full?"}, {"query": "Who is standing?"}, {"query": "What is wearing the women?"}, {"query": "Is the glass that looks black wearing women?"}, {"query": "Who is the black glass wearing?"}, {"query": "Does the full bottle look closed or open?"}, {"query": "Are the women eating or looking up?"}, {"query": "Who is looking up?"}, {"query": "Where are the people that are standing standing?"}, {"query": "Are there umbrellas or bags in this scene?"}]}
{"imageid": "n160935", "question": [{"query": "What is holding onto the mug?"}, {"query": "Which kind of fruit is fresh?"}, {"query": "Is the banana fresh and unripe?"}, {"query": "Is the yellow fruit to the right or to the left of the cup in the middle?"}, {"query": "What does the lunch box sit on top of?"}, {"query": "Is the white napkin on the right side of the picture?"}, {"query": "How hard is the sheet on the right?"}, {"query": "What is the empty cup sitting inside of?"}, {"query": "Is the empty cup sitting inside a lunch box?"}, {"query": "What is the banana sitting inside of?"}, {"query": "What is the fruit that is not unripe sitting inside of?"}, {"query": "Is the sheet on the right or on the left side?"}, {"query": "Is the white napkin made of paper or cloth?"}, {"query": "Is the lunch box made of the same material as the mug?"}, {"query": "Is the wire holding onto the metal mug?"}, {"query": "What is the wire holding onto?"}, {"query": "Is this lunch box metallic and large?"}, {"query": "What material is the empty cup?"}, {"query": "Do you see either a cup or a plate in the photo?"}, {"query": "What sits on top of the sheet?"}, {"query": "What is the lunch box made of?"}, {"query": "What is the cup to the right of the napkin made of?"}, {"query": "What fruit is sitting inside the container that is sitting on top of the bed sheet?"}, {"query": "Is the napkin red and soft?"}, {"query": "What is the cloth napkin sitting inside of?"}, {"query": "How big is the black thing to the right of the other cup?"}, {"query": "Does the cup that is not full look small and yellow?"}, {"query": "Is the banana on the left side?"}, {"query": "What is this mug sitting inside of?"}]}
{"imageid": "n360708", "question": [{"query": "What is hang from the building behind the fence?"}, {"query": "Is the square window made of metal or glass?"}, {"query": "Are there giraffes or fences in this picture?"}, {"query": "How thick is the fence made of wood?"}, {"query": "What is the shape of that window?"}, {"query": "What kind of animal is walking behind the plants?"}, {"query": "What animal is walking behind the plants that are shown in the image?"}, {"query": "What is the name of the tall animal?"}, {"query": "Is the tall giraffe in front or behind the rock?"}, {"query": "What's in front of the giraffe?"}, {"query": "Are there any floor lamps or objects in the image?"}, {"query": "What is in front of the giraffe?"}, {"query": "What type of animal is that?"}, {"query": "What is the fence made of?"}, {"query": "What is in front of the building?"}, {"query": "Which kind of animal is behind the rock?"}, {"query": "Is the fence in front of the building made of metal?"}, {"query": "Is the door open?"}, {"query": "Is the door open and rectangular?"}, {"query": "Is there a fence made of wood?"}, {"query": "What is the animal that is not short walking behind of?"}, {"query": "What animal is before the fence?"}, {"query": "What animal is in front of the fence?"}, {"query": "What is the fence behind of, a giraffe or an elephant?"}, {"query": "Is the large building behind a fence?"}, {"query": "What's the giraffe in front of?"}, {"query": "Are there any cars or fences in this scene?"}, {"query": "Is the tall fence behind a giraffe?"}, {"query": "What is in front of the building that looks white?"}]}
{"imageid": "n177259", "question": [{"query": "Does the hat have red color?"}, {"query": "Are there either any white hats or scarves?"}, {"query": "Is the male person riding on the snowboard that looks blue?"}, {"query": "Is this a ski or a snowboard?"}, {"query": "Are the boots different in color than the snowpants?"}, {"query": "Are the trees green and hard?"}, {"query": "What is the person in front of?"}, {"query": "Are the snow pants black or yellow?"}, {"query": "What tone does the snowboard have?"}, {"query": "Does the shirt look red?"}, {"query": "Do the snowboard and the shirt have the same color?"}, {"query": "What is he in front of?"}, {"query": "Is the person that is riding female or male?"}, {"query": "Does the jacket have the same color as the glove?"}, {"query": "Are there white skis or snowboards in the photo?"}, {"query": "Are the shirt and the hat the same color?"}, {"query": "What is in front of the sky?"}, {"query": "What are the trees in front of?"}, {"query": "What is he riding on?"}, {"query": "Are there mattresses or snowboards?"}, {"query": "What is the device that he wears?"}, {"query": "What is he doing?"}, {"query": "Does that snow board look smooth?"}, {"query": "Does the snowboard look black and smooth?"}, {"query": "What do the sky and the snowboard have in common?"}]}
{"imageid": "n38280", "question": [{"query": "Do the garage and the building have the same color?"}, {"query": "Who is wearing the helmet?"}, {"query": "What is parked on the ground?"}, {"query": "Do the building and the uniform have a different colors?"}, {"query": "Is the helmet to the left or to the right of the vehicle that is in front of the building?"}, {"query": "Who in the image is sitting?"}, {"query": "What is the person doing?"}, {"query": "Is the person that is not short sitting or standing?"}, {"query": "What vehicle is in front of the white building?"}, {"query": "What is the building behind of, a car or a bus?"}, {"query": "What kind of vehicle is the building behind of?"}, {"query": "Is the color of the uniform black?"}, {"query": "Which kind of clothing is black?"}, {"query": "Is the ground rough?"}, {"query": "What is the vehicle to the right of the person that is wearing a helmet?"}, {"query": "What is the person in front of?"}, {"query": "Who is in front of the garage?"}, {"query": "Who is wearing the uniform?"}, {"query": "Who is wearing a uniform?"}, {"query": "Are there cones or helmets?"}]}
{"imageid": "n445396", "question": [{"query": "Is there a window that is little?"}, {"query": "Is the toilet large or small?"}, {"query": "What is the piece of furniture that is above the sink?"}, {"query": "On which side of the image are the white towels?"}, {"query": "On which side of the image is the large cabinet, the left or the right?"}, {"query": "Does the white cabinet near the light fixture seem to be large and closed?"}, {"query": "What is sitting beside the window?"}, {"query": "Is the toilet large and round?"}, {"query": "Do you see a brown coffee table or cabinet?"}, {"query": "Is the mat brown?"}, {"query": "Is the toilet that is not dirty sitting next to the bathtub?"}, {"query": "Do the toilet and the mat have the same color?"}, {"query": "Are there both drawers and cabinets in the image?"}, {"query": "Does the mat next to the tub look dirty?"}, {"query": "Are there wigs or drawers in the picture?"}, {"query": "On which side of the image is the toilet?"}, {"query": "How clean is the bathtub near the mat?"}, {"query": "Is the color of the toilet white?"}, {"query": "What is under the cabinet on the right?"}, {"query": "What's under the cabinet?"}, {"query": "Are the shelves to the right of the mat both white and empty?"}, {"query": "Are the shelves on the right?"}, {"query": "Is the cabinet small?"}, {"query": "Are the empty shelves to the right of a mat?"}, {"query": "Which kind of furniture is to the right of the mat?"}, {"query": "Does the bathroom have blue color?"}, {"query": "What is sitting next to the tub?"}, {"query": "What is sitting next to the bathtub?"}, {"query": "What's the toilet sitting next to?"}, {"query": "Is the sink below the cabinet?"}, {"query": "Is the sink below or above the cabinet?"}, {"query": "Are the shelves empty?"}, {"query": "Is it outdoors or indoors?"}, {"query": "Is the mirror on the right part?"}]}
{"imageid": "n161912", "question": [{"query": "Is the floor brown or green?"}, {"query": "Which kind of furniture is to the right of the napkin?"}, {"query": "How is the piece of furniture that is on the floor called?"}, {"query": "Are the wine glasses narrow or wide?"}, {"query": "Does the table appear to be blue?"}, {"query": "What is the color of the napkin?"}, {"query": "Is the napkin green and rectangular?"}, {"query": "Does the shirt look short sleeved or long sleeved?"}, {"query": "Do the wine glasses on the table look tall?"}, {"query": "Are the wine glasses tall and narrow?"}, {"query": "Is there a chair on the floor?"}, {"query": "What is the item of furniture that is on the floor?"}, {"query": "What is the piece of furniture to the right of the man?"}, {"query": "What kind of furniture is wide?"}, {"query": "Is that table made of wood or granite?"}, {"query": "Does the old person look Asian?"}, {"query": "Is there any chair on the floor?"}, {"query": "How is the item of furniture that is on the floor called?"}, {"query": "What shape is the napkin that looks green?"}, {"query": "What are the wine glasses made of?"}, {"query": "On which side of the photo are the wine glasses?"}, {"query": "Which kind of furniture is not brown?"}, {"query": "Do the pants have black color and long length?"}, {"query": "Which kind of furniture is on the floor?"}, {"query": "What item of furniture are the wine bottles on?"}, {"query": "What is the weight of the wine bottles?"}, {"query": "Is the old person to the right or to the left of the wine glasses that are on the left?"}, {"query": "Does the person to the left of the chair look Caucasian and old?"}, {"query": "Do the long pants look black?"}, {"query": "How old is the man that is wearing pants?"}, {"query": "What kind of furniture is not wide?"}, {"query": "Are there both tables and chairs in the photo?"}]}
{"imageid": "n362961", "question": [{"query": "Are both the electric toothbrush that looks dark blue and white and the electric toothbrush that looks white and dark blue made of plastic?"}, {"query": "How tall is the electric toothbrush that is not wide?"}, {"query": "Do you see any electric toothbrushes in front of the window?"}, {"query": "Which side are the toothbrushes on?"}, {"query": "Which part is the plastic cup in, the top or the bottom?"}, {"query": "What width do you think the electric toothbrush that is white and dark blue is?"}, {"query": "Is the electric toothbrush next to the toothbrushes dark blue and wide?"}, {"query": "Are there cups or mugs that are made of glass?"}, {"query": "Which color is the electric toothbrush on the right?"}, {"query": "Are there any toothbrushes to the left of the electric toothbrush next to the cup?"}, {"query": "Is the electric toothbrush that is not short narrow and dark blue?"}, {"query": "What is the electric toothbrush next to the toothbrushes made of?"}, {"query": "Do the toothbrushes near the electric toothbrush look white or blue?"}, {"query": "Do you see wine glasses near the electric toothbrush that looks dark blue and light blue?"}, {"query": "What is the cup holding?"}, {"query": "What is the cup that is made of plastic holding?"}, {"query": "What is holding the toothbrushes in front of the window?"}, {"query": "What is the cup in front of?"}, {"query": "Is there a cat in front of the glass window?"}]}
{"imageid": "n488691", "question": [{"query": "Is the brown shirt long sleeved or short sleeved?"}, {"query": "Is the person that is to the left of the men Asian and young?"}, {"query": "Is the asphalt road rough or smooth?"}, {"query": "Does the road appear to be white and smooth?"}, {"query": "What is the color of the shirt the woman is wearing?"}, {"query": "Are the men standing?"}, {"query": "Who is sitting?"}, {"query": "What is the hat hang from?"}, {"query": "What is hang from the bicycle?"}, {"query": "On which side is the popcorn?"}, {"query": "What ethnicity do you think the men the woman is standing in front of are?"}, {"query": "On which side are the men?"}, {"query": "What is the bicycle resting on?"}, {"query": "What is resting on the crosswalk?"}, {"query": "Are the hat and the bicycle the same color?"}, {"query": "Are the bicycle and the drain made of the same material?"}, {"query": "Does the seat have the same color as the bicycle?"}, {"query": "What is the young person standing on top of?"}, {"query": "Who is standing on top of the crosswalk made of asphalt?"}, {"query": "What's the woman standing on top of?"}, {"query": "Does the food in front of the woman look white?"}, {"query": "What is the woman holding onto?"}, {"query": "The person behind the popcorn is holding onto what?"}, {"query": "Does the popcorn that is to the right of the bicycle look white and empty?"}, {"query": "What is on the crosswalk?"}, {"query": "What is the drain on?"}, {"query": "Is the woman Caucasian or Asian?"}, {"query": "Are both the seat and the drain made of the same material?"}, {"query": "What type of food is to the right of the bicycle?"}, {"query": "Who is wearing the sandal?"}, {"query": "Who is standing?"}, {"query": "What are the Asian men doing?"}, {"query": "Who is driving?"}, {"query": "Is the young woman behind the food that looks full?"}, {"query": "What is the food that the woman is behind of?"}, {"query": "Which kind of food is the woman behind of?"}, {"query": "What is in front of the woman that is wearing a shirt?"}, {"query": "Who is the popcorn in front of?"}, {"query": "Is the sandal open and blue?"}, {"query": "Is the shirt brown and long sleeved?"}, {"query": "Is the woman old?"}, {"query": "Who is older, the woman or the men?"}, {"query": "Is the young person on the left side?"}, {"query": "Are the motorcycles in the bottom or in the top part?"}, {"query": "Is the food to the right of the bicycle full or empty?"}, {"query": "What is in front of the woman?"}, {"query": "What type of food is in front of the person that is standing on top of the crosswalk?"}, {"query": "Is the hat made of straw yellow and round?"}, {"query": "Who is looking up?"}, {"query": "What is the woman doing?"}, {"query": "Is the woman looking up or eating?"}, {"query": "Who is standing in front of the people the motorbikes are to the left of?"}, {"query": "What color do you think the hat made of straw is?"}]}
{"imageid": "n463195", "question": [{"query": "What kind of furniture is the glass on?"}, {"query": "Is the glass on a shelf?"}, {"query": "What is the height of the desk?"}, {"query": "Is the tablet the same color as the laptop?"}, {"query": "Which kind of furniture is below the mirror?"}, {"query": "What type of furniture is in the desk the mirror is above?"}, {"query": "Is the bottle in the bottom or in the top part?"}, {"query": "What is the name of the item of furniture that the glass is on?"}, {"query": "Does the laptop above the paper look large?"}, {"query": "Does the computer mouse have white color?"}, {"query": "What kind of furniture is in the desk?"}, {"query": "What device is on the desk?"}, {"query": "Which kind of furniture is the computer mouse on?"}, {"query": "What is the computer mouse on?"}, {"query": "What kind of furniture is below the mirror?"}, {"query": "Which kind of furniture is made of wood?"}, {"query": "What kind of device is on the desk?"}, {"query": "Is there a laptop on the desk below the mirror?"}, {"query": "What is the device on the desk made of wood?"}, {"query": "Are the tablet on the desk and the device above the paper both black?"}, {"query": "Is the tablet open and black?"}, {"query": "Is the tablet on a sofa?"}, {"query": "What kind of furniture is the tablet on?"}, {"query": "Is there a laptop near the small device?"}, {"query": "Does the mirror look silver and round?"}, {"query": "What's the glass on?"}, {"query": "On which side of the image is the black tablet?"}, {"query": "Is the device which is to the left of the laptop open or closed?"}, {"query": "Does the device near the computer mouse look small and black?"}, {"query": "What is underneath the large device?"}, {"query": "Is the paper underneath a DVD player?"}, {"query": "Is the paper below the laptop to the right of the tablet?"}, {"query": "What type of furniture in the picture is made of wood?"}, {"query": "Which kind of furniture is wooden?"}, {"query": "What kind of furniture isn't wooden?"}, {"query": "Are there any monitors to the right of the laptop above the paper?"}, {"query": "Do you see either computer mousess or headphones there?"}, {"query": "What is the piece of furniture in the desk?"}, {"query": "Which kind of device is on the desk?"}, {"query": "Is the small notebook on the left side?"}, {"query": "What kind of furniture is tall?"}, {"query": "Which kind of furniture is not tall?"}, {"query": "What device is large?"}, {"query": "Which kind of furniture is to the left of the laptop?"}, {"query": "Is the computer mouse white and small?"}, {"query": "Which kind of furniture is to the right of the laptop?"}]}
{"imageid": "n488813", "question": [{"query": "What is the name of the animal that is standing at the fence made of wood?"}, {"query": "Is the blond hair straight or curly?"}, {"query": "What is located on top of the still horse?"}, {"query": "Where is the horse that looks still standing?"}, {"query": "Which animal is cream colored?"}, {"query": "What animal is cream colored?"}, {"query": "Are there both snow and grass in the image?"}, {"query": "Does the fence appear to be white and tall?"}, {"query": "Are there trains below the cloudy sky?"}, {"query": "Is the horse behind the other horse both calm and cream colored?"}, {"query": "Which animal is still?"}, {"query": "Are there any sheep below the tree branches that are not dense?"}, {"query": "Does the horse's hair seem to be curly?"}, {"query": "Where is the horse that looks cream colored standing?"}, {"query": "Is the horse that looks cream-colored standing at a fence?"}, {"query": "What animal is standing at the white fence?"}, {"query": "What is the height of the fence?"}, {"query": "What is the color of the horse that is behind the other horse?"}, {"query": "What is located on top of the horse that is cream colored?"}, {"query": "What is located on top of the horse the sky is above?"}, {"query": "How long is the horse's hair?"}, {"query": "What color does the light hair have?"}, {"query": "What animal is below the tree branches?"}, {"query": "Which kind of animal is below the sky?"}, {"query": "Is the sky cloudy and gray?"}, {"query": "What is the fence made of?"}, {"query": "Of what material the fence?"}, {"query": "Are the tree branches above a horse?"}, {"query": "Is the horse's hair blond and straight?"}, {"query": "What color is the horse's hair?"}, {"query": "Is there either a white fence or ball?"}, {"query": "Which color does the sky the horse is below have?"}]}
{"imageid": "n451122", "question": [{"query": "Is the traffic light on the street red and high?"}, {"query": "Are there either any street signs or traffic lights that are not yellow?"}, {"query": "Are the leaves both large and green?"}, {"query": "Do the leaves look large or small?"}, {"query": "Are the trees that look thick white and dense?"}, {"query": "Who is riding the bicycles that are on the street?"}, {"query": "Who is riding the bicycles?"}, {"query": "What are the grouped people riding?"}, {"query": "Are the grouped people riding horses?"}, {"query": "Is the window made of the same material as the street lamp?"}, {"query": "Where is the traffic light?"}, {"query": "Where is the street light?"}, {"query": "Does the backpack have the same color as the flag?"}, {"query": "Is the flag red?"}, {"query": "Is there a briefcase on the back of the person that is standing?"}, {"query": "Which place is it?"}, {"query": "Are these skateboards or bicycles?"}, {"query": "How clean is the city?"}, {"query": "Are there either snowboards or flags in the picture?"}, {"query": "Is the house in the bottom of the picture?"}, {"query": "Where are the bicycles?"}]}
{"imageid": "n167917", "question": [{"query": "Are the trees tall and green?"}, {"query": "Is this a truck or a bus?"}, {"query": "Are there any vehicles or trucks that are waiting?"}, {"query": "What vehicle is waiting?"}, {"query": "Does the green lawn look healthy?"}, {"query": "Are there cars or trucks?"}, {"query": "Are there any red cars or trucks?"}, {"query": "What is the color of the huge truck?"}, {"query": "Does the huge truck appear to be off?"}, {"query": "Which place is it?"}, {"query": "Which place is the image at?"}, {"query": "What vehicle is off?"}, {"query": "How large is the truck that is not on?"}, {"query": "What is the vehicle on top of the lawn called?"}, {"query": "What is located on top of the lawn?"}, {"query": "Is the green lawn grassy and healthy?"}]}
{"imageid": "n399930", "question": [{"query": "What color is the striped shirt, gray or purple?"}, {"query": "Is the color of the controller different than the pillow?"}, {"query": "Is the man in front of a couch?"}, {"query": "What is the man in front of?"}, {"query": "Do you see a pillow beside the man?"}, {"query": "What is the small item of furniture?"}, {"query": "What is the piece of furniture in the image called?"}, {"query": "Is the pillow soft and red?"}, {"query": "On which side of the photo is the pillow?"}, {"query": "What is the person that is to the left of the man doing?"}, {"query": "Is the standing person to the left of the pillow wearing shorts?"}, {"query": "Which kind of furniture is to the left of the pillow?"}, {"query": "Is that a mirror or a couch?"}, {"query": "Are there either pillows or blankets that are not red?"}, {"query": "Is the shirt both orange and striped?"}, {"query": "What kind of furniture is the man in front of?"}, {"query": "Is there a couch behind the person that is wearing glasses?"}, {"query": "What is the item of furniture that is behind the person that wears glasses?"}, {"query": "Is the pillow that is to the right of the controller red or gray?"}, {"query": "Is the man to the right of a bag?"}, {"query": "Is the couch to the right or to the left of the pillow?"}, {"query": "Is the man in front of the couch using a laptop?"}, {"query": "What device is the man using?"}, {"query": "What do you think is the device that that man is using?"}, {"query": "What is the item of furniture behind the person to the left of the pillow called?"}, {"query": "What is the color of the device the man is using?"}, {"query": "Is this a large couch?"}, {"query": "What is the person to the left of the man wearing?"}, {"query": "Is the person to the left of the man wearing glasses?"}, {"query": "What is the person to the left of the pillow using?"}, {"query": "What is the man using?"}, {"query": "Is the controller to the left of the person that is wearing glasses?"}, {"query": "Which color is the couch that is not big?"}, {"query": "Is the couch behind the man brown and small?"}]}
{"imageid": "n396759", "question": [{"query": "Is the car on the right side or on the left of the photo?"}, {"query": "Are there both cars and mirrors in the photo?"}, {"query": "The car behind the bus is of what color?"}, {"query": "What vehicle isn't large?"}, {"query": "Is the parked car in front of the bus that is not little?"}, {"query": "What is the building in front of?"}, {"query": "What's the building in front of?"}, {"query": "Is the door below the red flowers?"}, {"query": "Does the mirror look black and small?"}, {"query": "Do the door and the car have the same color?"}, {"query": "What color is the door below the flowers?"}, {"query": "Is the building behind or in front of the pole?"}, {"query": "Are there both doors and windows in the picture?"}, {"query": "Is the mirror on the left side?"}, {"query": "Do the flowers that are not big look leafy and blue?"}, {"query": "What vehicle is to the right of the mirror?"}, {"query": "What shape is the glass window?"}, {"query": "Is the mirror to the left or to the right of the black car?"}, {"query": "Is the large vehicle in front of the parked vehicle?"}, {"query": "What is the vehicle that is parked near the large vehicle?"}, {"query": "Is the black vehicle to the left or to the right of the bus?"}, {"query": "What color is the small mirror?"}, {"query": "What is the name of the vehicle in front of the pole?"}, {"query": "Are the flowers white?"}, {"query": "Are the red flowers above the door?"}, {"query": "Is there a rectangular door in this image?"}, {"query": "How large is the black mirror?"}, {"query": "What is the size of the vehicle to the left of the car?"}, {"query": "Is there a white bed or mirror?"}, {"query": "What vehicle is parked near the bus?"}, {"query": "What is parked near the vehicle that the pole is behind of?"}]}
{"imageid": "n170590", "question": [{"query": "What is that fence surrounding?"}, {"query": "Does the person who is to the right of the car look young?"}, {"query": "What does the man ride?"}, {"query": "What vehicle is the water in front of?"}, {"query": "What is the fence surrounding?"}, {"query": "The car is on what?"}, {"query": "What is the car on?"}, {"query": "How clean are the black wheels?"}, {"query": "Is the man angry?"}, {"query": "How large is the bridge the road contains?"}, {"query": "What contains bridge?"}, {"query": "What are the evergreen trees surrounding?"}, {"query": "What are the trees surrounding?"}, {"query": "Is the motorbike old fashioned and new?"}, {"query": "Which kind of vehicle is the motorcycle in front of?"}, {"query": "Do you see any trains on the bridge?"}, {"query": "Does the bridge look dirty?"}, {"query": "Does the license plate that looks small look red or yellow?"}, {"query": "Do you see both fences and glasses?"}, {"query": "What color is the old shirt?"}, {"query": "Do you see a wood fence?"}, {"query": "What is the water in front of?"}, {"query": "How is the vehicle that the water is in front of called?"}, {"query": "On which side of the image is the old motorcycle?"}, {"query": "What does the road contain?"}, {"query": "Is the car behind a bus?"}, {"query": "What is the vehicle behind the water?"}, {"query": "What is the fence made of?"}, {"query": "Is the bridge surrounded by the fence?"}, {"query": "On which side of the photo is the old person?"}, {"query": "Is the license plate black and small?"}, {"query": "Are the wheels both black and dirty?"}, {"query": "Are the trees leafless and grassy?"}, {"query": "Are there either any CDs or motorcycles?"}, {"query": "Is the old person to the right or to the left of the car?"}, {"query": "Is the old man to the left of the car the water is in front of?"}, {"query": "Which kind of vehicle is old fashioned?"}, {"query": "Does the car look blue and old fashioned?"}, {"query": "Is the bridge large and clean?"}, {"query": "Does the shirt seem to be old?"}, {"query": "Which shape is the license plate that is not large?"}, {"query": "Does the white shirt appear to be large?"}]}
{"imageid": "n49224", "question": [{"query": "What color do you think the door is?"}, {"query": "Are both the backpack and the street the same color?"}, {"query": "What color is the food truck?"}, {"query": "Are there red food trucks or fire trucks?"}, {"query": "Is the picture round?"}, {"query": "Do the jeans look blue or dark?"}, {"query": "What is the picture on?"}, {"query": "Does the shirt that is not short sleeved look white?"}, {"query": "What is the person in front of?"}, {"query": "Does the full bag have green color?"}, {"query": "Is that picture small or large?"}, {"query": "What is on the food truck?"}, {"query": "Is the white door closed or open?"}, {"query": "Does the counter have a different color than the shirt?"}, {"query": "Is the tire round and red?"}, {"query": "Is the shirt white and long sleeved?"}, {"query": "Is the person wearing a backpack?"}, {"query": "Do the jeans have blue color and long length?"}, {"query": "Is the backpack full and black?"}, {"query": "Is the food truck made of steel?"}, {"query": "Are both the counter behind the person and the food truck in the image white?"}, {"query": "Where is the person standing on?"}, {"query": "Does the person in front of the counter appear to be waiting?"}, {"query": "Is the tree above a giraffe?"}]}
{"imageid": "n285931", "question": [{"query": "What is the item of furniture below the beautiful painting?"}, {"query": "Is the bed to the left or to the right of the lamp on the right side of the picture?"}, {"query": "On which side of the picture is the plastic tray?"}, {"query": "What type of furniture is not white, the bed or the cabinet?"}, {"query": "Is this a bed or a mirror?"}, {"query": "Which kind of furniture is not white?"}, {"query": "Is there a chair to the left of the lamp on the right?"}, {"query": "Do you see both pillows and life jackets in the scene?"}, {"query": "Do the tray and the bed have the same color?"}, {"query": "What item of furniture is tall?"}, {"query": "What kind of furniture is not tall?"}, {"query": "Does the lamp to the left of the pillow look gold?"}, {"query": "Is the pillow to the left of the other pillow white and square?"}, {"query": "Is there a couch in the photo?"}, {"query": "What is the name of the item of furniture that is to the left of the cabinet?"}, {"query": "Is the bed to the left or to the right of the alarm clock?"}, {"query": "What shape is the painting?"}, {"query": "Is the painting above the bed ugly and square?"}, {"query": "What kind of furniture is the same color as the blanket that is not uncomfortable?"}, {"query": "What do you think is the tray on?"}, {"query": "What is the tray on?"}, {"query": "Is the pillow to the left of the lamp white and square?"}, {"query": "Which color is the lamp that is on the cabinet?"}, {"query": "Are there mirrors on the cabinet?"}, {"query": "Is there any lamp or couch in the scene?"}, {"query": "Is the painting above a fireplace?"}, {"query": "What kind of furniture is to the right of the blanket?"}, {"query": "Is the tray made of the same material as the cabinet?"}, {"query": "What is the tall item of furniture?"}, {"query": "Are there curtains to the right of the lamp on the left side?"}, {"query": "What color is the cabinet?"}, {"query": "What color is the tray?"}, {"query": "What is this blanket on?"}, {"query": "Is the bright lamp next to the alarm clock both tall and gold?"}, {"query": "Are there any tables or suitcases?"}, {"query": "Is there either any white bed or table?"}, {"query": "What is the alarm clock on?"}, {"query": "Is this a white blanket?"}]}
{"imageid": "n348873", "question": [{"query": "Which shape is the dresser to the left of the painting?"}, {"query": "Is the dresser rectangular and white?"}, {"query": "What color is the storage box?"}, {"query": "What kind of furniture is to the left of the man that is looking at the woman?"}, {"query": "Do the storage box and the painting have a different colors?"}, {"query": "Are the piled clothes above the storage box?"}, {"query": "Is there a bag or a chair in this picture?"}, {"query": "Do you see pillows to the right of the dresser on the left side of the photo?"}, {"query": "What type of furniture is that woman standing beside of?"}, {"query": "What's the woman standing beside of?"}, {"query": "What kind of furniture is to the left of the man?"}, {"query": "How is the piece of furniture to the left of the woman that is to the left of the man called?"}, {"query": "Are there any bags to the left of the person that is to the left of the man?"}, {"query": "Which kind of clothing is striped?"}, {"query": "Does the storage box made of plastic appear to be white and closed?"}, {"query": "What is common to the bed and the storage box?"}, {"query": "What shape is this painting?"}, {"query": "Does that painting look red and square?"}, {"query": "Is the woman in front of a mirror?"}, {"query": "Who is standing beside the rectangular bed?"}, {"query": "Who is standing beside the bed?"}, {"query": "Who is the man to the right of the bed looking at?"}, {"query": "Who is the man looking at?"}, {"query": "What kind of furniture is behind the woman?"}, {"query": "What is the item of furniture behind the woman?"}, {"query": "Is the bed to the left of a chair?"}, {"query": "Who is before the bed?"}, {"query": "What kind of furniture is the man in front of?"}, {"query": "What is this man in front of?"}, {"query": "What is the man in front of?"}, {"query": "Is this a blue bed?"}, {"query": "What is the piece of furniture to the left of the painting?"}, {"query": "Which kind of furniture is left of the painting?"}, {"query": "Is the dresser to the left of a lamp?"}, {"query": "What is the name of the piece of furniture that has the same color as the storage box?"}, {"query": "What kind of furniture is not blue?"}, {"query": "What is the piece of furniture that is not blue?"}, {"query": "Which kind of furniture is blue?"}, {"query": "What kind of furniture is not blue, the bed or the dresser?"}, {"query": "Which kind of furniture is the woman in front of?"}, {"query": "What's the woman in front of?"}, {"query": "What type of furniture is the woman in front of?"}, {"query": "What is that woman in front of?"}, {"query": "What is the item of furniture behind the man called?"}, {"query": "What kind of furniture is behind the man?"}, {"query": "Are there beds behind the person on the right of the picture?"}, {"query": "Is the man standing beside a storage box?"}, {"query": "Is the dresser on the left side?"}, {"query": "Who is wearing the shirt?"}, {"query": "Which side of the photo is the man on?"}, {"query": "Does the bed to the left of the man look blue and rectangular?"}, {"query": "What is the person in front of the bed standing beside of?"}, {"query": "What is the man standing beside of?"}, {"query": "What is the man wearing?"}]}
{"imageid": "n219755", "question": [{"query": "What are the vehicles that the building is behind of?"}, {"query": "Which part of the picture are the cars in, the top or the bottom?"}, {"query": "Is the person leaning over a skateboard?"}, {"query": "Which place is it?"}, {"query": "Does the person seem to be standing?"}, {"query": "What kind of vehicle is the building behind of?"}, {"query": "Is the person wearing a hat?"}, {"query": "Is the person wearing a helmet?"}, {"query": "What kind of vehicle is behind the fence?"}, {"query": "What is the person that is driving leaning over?"}, {"query": "Is the person wearing a tie?"}, {"query": "Is the fence behind the street gray and round?"}, {"query": "What color is the fence the cars are behind of?"}, {"query": "Is the street straight and unpaved?"}, {"query": "Which side of the image is the bag on?"}, {"query": "Which kind of vehicle is the fence in front of?"}, {"query": "What's the fence in front of?"}, {"query": "What is the fence in front of?"}, {"query": "What vehicles are to the right of the bag that is hanging off the person?"}, {"query": "What are the cars in front of?"}, {"query": "What is in front of the vehicles made of metal?"}, {"query": "What is in front of the cars?"}, {"query": "Does the helmet look black and hard?"}, {"query": "Are the jeans made of cotton?"}, {"query": "Are the parked vehicles behind the fence?"}, {"query": "What kind of vehicle is in front of the building that is not little?"}, {"query": "What is in front of the building made of brick?"}, {"query": "What is in front of the building?"}, {"query": "Which kind of vehicle is in front of the building?"}, {"query": "Are there motorcycles or helmets?"}, {"query": "Is the jacket black and short sleeved?"}]}
{"imageid": "n524673", "question": [{"query": "On which side is the woman?"}, {"query": "What kind of aircraft is large?"}, {"query": "What is the aircraft that the woman is looking at?"}, {"query": "That woman is looking at what?"}, {"query": "What is in front of the intricate building?"}, {"query": "What is in front of the flat building?"}, {"query": "Does the sky appear to be partly cloudy?"}, {"query": "Does the sky look blue and clear?"}, {"query": "Where is the person to the left of the man standing on?"}, {"query": "What are the wet people doing?"}, {"query": "What kind of aircraft is flying in the sky?"}, {"query": "What is the aircraft that the adult person to the right of the woman looks at?"}, {"query": "Which kind of aircraft does the man look at?"}, {"query": "Does the man that to the right of the woman look at the large jet?"}, {"query": "Does the weather appear to be overcast in this scene?"}, {"query": "What kind of aircraft is flying?"}, {"query": "Which side of the image is the man on?"}, {"query": "What is the woman looking at?"}, {"query": "What kind of aircraft is the woman looking at?"}, {"query": "Is the woman looking at a phone?"}, {"query": "What is the aircraft that is flying above the ocean?"}, {"query": "What is flying in the sky?"}, {"query": "What is flying above the ocean?"}, {"query": "Do the people that are swimming look dry?"}, {"query": "Do you see kites or umbrellas there?"}, {"query": "Where are the people that are standing standing on?"}, {"query": "Who is standing?"}, {"query": "Is the jet both large and white?"}, {"query": "Does the white jet look large?"}, {"query": "What does the man look at?"}, {"query": "What does the person to the right of the woman look at?"}]}
{"imageid": "n29167", "question": [{"query": "Are the shorts short and blue?"}, {"query": "What color are the shorts?"}, {"query": "What is the woman hitting?"}, {"query": "Who is wearing shorts?"}, {"query": "Is the strong woman wearing shorts?"}, {"query": "Are there either frisbees or boys in the picture?"}, {"query": "What color do you think the hat is?"}, {"query": "What's the racket hitting?"}, {"query": "Who is wearing the shorts?"}, {"query": "Is the woman to the left or to the right of the tennis ball?"}, {"query": "Do the shorts look comfortable?"}, {"query": "Does that hat look dirty?"}, {"query": "What is that racket hitting?"}, {"query": "Is the tank top white or blue?"}, {"query": "What is the athletic person hitting?"}]}
{"imageid": "n112552", "question": [{"query": "Are there any dogs or giraffes?"}, {"query": "Which kind of animal is sitting atop the snow?"}, {"query": "What is the dog to the left of the bench sitting atop?"}, {"query": "What type of animal is sitting atop the snow?"}, {"query": "What animal are the kids looking at?"}, {"query": "Who is looking at the dog?"}, {"query": "Who is looking at the animal that is sitting atop the snow?"}, {"query": "What kind of animal are the children looking at?"}, {"query": "Does the bench to the right of the dog look huge and stone?"}, {"query": "What are the trees covered by?"}, {"query": "Does the bench to the right of the dog have small size?"}, {"query": "How large is the animal the kids are looking at?"}, {"query": "What does the bench to the right of the dog sit atop?"}, {"query": "Are the kids in the bottom or in the top?"}]}
{"imageid": "n237405", "question": [{"query": "Which kind of clothing is black?"}, {"query": "Which type of clothing is black?"}, {"query": "Is the person to the left of the backpack holding a racket?"}, {"query": "Do you see any black backpacks or bags?"}, {"query": "What is the vehicle to the right of the person that is wearing a backpack?"}, {"query": "Is the person to the left of the van wearing a jacket?"}, {"query": "Which kind of vehicle are the trees behind of?"}, {"query": "What kind of vehicle are the trees behind of?"}, {"query": "Is the person to the left of the van eating or is he waiting?"}, {"query": "What is the van in front of?"}, {"query": "What vehicle is in front of the trees?"}, {"query": "What is the vehicle in front of the green trees called?"}, {"query": "What is in front of the trees?"}, {"query": "What is in front of the green trees?"}, {"query": "Is the color of the road different than that of the suit?"}, {"query": "Are the brick buildings behind the person old and short?"}, {"query": "What color does this umbrella have?"}, {"query": "Does the person that is to the left of the other person seem to be walking?"}, {"query": "Is the van driving?"}, {"query": "Do the collar and the sign have the same color?"}, {"query": "Does that umbrella look open and black?"}, {"query": "Is the black backpack to the right or to the left of the person on the left?"}]}
{"imageid": "n319097", "question": [{"query": "Do both the device to the right of the mouse pad and the laptop to the left of the speaker look square?"}, {"query": "What is the laptop made of?"}, {"query": "How large is the device to the right of the mousepad?"}, {"query": "Is the mouse on the left side?"}, {"query": "Is the mouse to the left of the calculator rounded and small?"}, {"query": "What is the device on top of the wood desk?"}, {"query": "Is there a keyboard in front of the electronic device near the speaker?"}, {"query": "What is the device to the right of the speaker near the laptop computer called?"}, {"query": "On which side of the picture is the metal device?"}, {"query": "What kind of device is the wall behind of?"}, {"query": "What device has the same color as the mousepad made of cloth?"}, {"query": "Which shape is the computer monitor to the left of the speaker?"}, {"query": "What kind of device is in front of the white wall?"}, {"query": "Is the keyboard behind the other keyboard both black and rectangular?"}, {"query": "What device is to the right of the cell phone?"}, {"query": "Does the computer mouse that is to the left of the calculator look white?"}, {"query": "Which shape do you think is the device near the mobile phone?"}, {"query": "Do you see computer mice there?"}, {"query": "What is the device on top of the desk?"}, {"query": "Do you see both a game controller and a keyboard in the photograph?"}, {"query": "What kind of device is on top of the desk?"}, {"query": "Do you see laptops in this image?"}, {"query": "Is the wall behind a laptop?"}, {"query": "What is the device that the wall is behind of?"}, {"query": "What kind of device is to the right of the computer monitor that is in front of the wall?"}, {"query": "What device is to the left of the computer mouse that looks gray?"}, {"query": "What is the wall behind of, a television or a computer monitor?"}, {"query": "What kind of furniture is it?"}, {"query": "What kind of device is on top of the desk?"}, {"query": "Is the calculator black and square?"}, {"query": "Does the keyboard to the left of the mousepad look white?"}, {"query": "Are the calculator and the mouse pad the same color?"}, {"query": "Are there both controllers and speakers in the image?"}, {"query": "Is the mouse next to the other mouse red and rounded?"}, {"query": "What kind of device is to the left of the calculator?"}, {"query": "Are there any mouse pads near the keyboard in front of the computer monitor?"}, {"query": "Is there a speaker near the laptop made of plastic?"}, {"query": "What kind of device is in front of the wall?"}, {"query": "How the light brown piece of furniture is called?"}, {"query": "Which kind of furniture is made of wood?"}, {"query": "Does the keyboard in front of the other keyboard look black and rectangular?"}, {"query": "What's the laptop in front of?"}, {"query": "What is the laptop in front of?"}, {"query": "What device is the wall behind of?"}, {"query": "What is the color of the speaker to the right of the computer monitor?"}, {"query": "What size is the computer mouse to the left of the mouse?"}, {"query": "What do both the calculator and the laptop have in common?"}, {"query": "Do you see a white keyboard or chair?"}, {"query": "Is there a keyboard in the picture?"}, {"query": "Is the computer monitor to the left or to the right of the speaker on the right?"}, {"query": "What shape is the calculator?"}, {"query": "What is the device that is in front of the white wall?"}, {"query": "Is the mouse pad made of cloth white and rectangular?"}, {"query": "Does the mobile phone that is made of glass have rectangular shape and large size?"}, {"query": "How does the speaker that looks gray and black look, round or rectangular?"}, {"query": "On which side of the picture is the calculator?"}, {"query": "Are there any keyboards to the left of the mouse that is gray?"}, {"query": "Which side is the laptop on?"}, {"query": "What type of device is in front of the white wall?"}, {"query": "What item of furniture is light brown?"}, {"query": "Which kind of furniture is rectangular?"}, {"query": "What device is to the right of the laptop?"}, {"query": "Are there any televisions near the speaker to the right of the keyboard?"}, {"query": "What shape is that mouse pad?"}]}
{"imageid": "n365717", "question": [{"query": "Is the chair in front of the table?"}, {"query": "What type of furniture is the table behind of?"}, {"query": "What kind of furniture is behind the chair?"}, {"query": "Which side of the picture is the rectangular device on?"}, {"query": "Is the bookcase made of the same material as the desk?"}, {"query": "Is the ceiling light above the bookcase on the carpet?"}, {"query": "Is the bookcase open or closed?"}, {"query": "Is the appliance that is to the right of the chair black and square?"}, {"query": "What shape is the dryer behind the bag?"}, {"query": "Is the full bag in front of the appliance on the right side?"}, {"query": "What's the bag in front of?"}, {"query": "What is the chair to the left of the dryer made out of?"}, {"query": "Does the bag in front of the dryer look square?"}, {"query": "What kind of furniture is the computer monitor on?"}, {"query": "What device is on the desk?"}, {"query": "What item of furniture is not large?"}, {"query": "Which kind of furniture is large?"}, {"query": "Which item of furniture is large, the bookcase or the couch?"}, {"query": "Are the shoes in front of a bed?"}, {"query": "What kind of furniture is to the left of the chair?"}, {"query": "What do both the dryer and the bookcase have in common?"}, {"query": "Is the chair to the right or to the left of the books?"}, {"query": "Is the bookcase closed and wooden?"}, {"query": "What is the piece of furniture below the ceiling light?"}, {"query": "Of what shape is that bookcase?"}, {"query": "Is the bookcase to the right or to the left of the chair?"}, {"query": "What is in front of the table the guitar is on top of?"}, {"query": "Is there either a small nightstand or bookcase?"}, {"query": "What is the item of furniture to the left of the guitar?"}, {"query": "Which kind of furniture is to the left of the guitar?"}, {"query": "What is the piece of furniture that is to the right of the device that is not turned on?"}, {"query": "What is the item of furniture to the left of the table?"}, {"query": "Is this a couch or a bed?"}, {"query": "Do the computer monitor and the ceiling light have the same color?"}, {"query": "What is the item of furniture that is the same shape as the appliance behind the bag called?"}, {"query": "What's the chair made of?"}, {"query": "What color is the couch above the carpet?"}, {"query": "On which side of the image is the couch?"}, {"query": "Are there both a chair and a desk?"}, {"query": "What is that bag in front of?"}, {"query": "What is in front of the dryer?"}, {"query": "What appliance is the bag in front of?"}, {"query": "The device on the desk has what shape?"}, {"query": "What is the device to the left of the bookcase made of wood?"}, {"query": "What type of appliance is to the right of the faucet that is to the right of the guitar?"}, {"query": "Does the round bag look dark?"}, {"query": "Which kind of furniture is to the left of the couch?"}, {"query": "What is the item of furniture to the left of the couch?"}, {"query": "Is the chair modern and black?"}, {"query": "What kind of furniture is above the carpet?"}, {"query": "Which kind of furniture is not square?"}, {"query": "What is this, a bookcase or a bed?"}, {"query": "Does the new carpet seem to be short?"}, {"query": "In front of what are the shoes?"}, {"query": "Are there any pillows to the right of the colorful books?"}, {"query": "Which kind of furniture is to the right of the bookcase?"}, {"query": "What is the name of the item of furniture that is to the right of the bookcase behind the shoes?"}, {"query": "What item of furniture is square?"}, {"query": "What device is to the left of the books?"}, {"query": "What appliance is behind the bag?"}, {"query": "Are there both pictures and bookcases in this scene?"}, {"query": "Is the large bookcase on the left side?"}, {"query": "What is the name of the appliance that has the same color as the ceiling light that is above the bookcase?"}, {"query": "What is common to the dryer and the ceiling light?"}, {"query": "What type of furniture is on the carpet?"}, {"query": "What is on the carpet?"}, {"query": "What do you think is on the carpet?"}, {"query": "What is the bookcase on?"}, {"query": "Which kind of furniture is on the carpet?"}, {"query": "Does the bag look full?"}, {"query": "Does the dryer have the same shape as the bag?"}, {"query": "Which kind of furniture is open?"}, {"query": "Which piece of furniture is square?"}, {"query": "What is the chair in front of?"}, {"query": "What color are the shoes in front of the bookcase?"}, {"query": "Do the couch and the guitar have a different colors?"}, {"query": "Is the carpet below a bed?"}, {"query": "What piece of furniture is to the left of the dryer?"}, {"query": "How is the item of furniture that the shoes are in front of called?"}, {"query": "How large is the bookcase made out of wood?"}, {"query": "Does the instrument to the right of the bookcase look short?"}, {"query": "What is the item of furniture above the carpet?"}, {"query": "What shape do you think the long table has?"}, {"query": "What item of furniture is behind the shoes?"}, {"query": "Does the dark bag look full and round?"}, {"query": "What kind of furniture is cluttered?"}]}
{"imageid": "n265798", "question": [{"query": "Is the plate round and green?"}, {"query": "Does the glass plate look white?"}, {"query": "What is common to the saucer and the vase?"}, {"query": "Is the platter made of the same material as the vase?"}, {"query": "What is the color of the table?"}, {"query": "Is the platter white and round?"}, {"query": "Which shape is the platter?"}, {"query": "Is that cracker on a cup?"}, {"query": "Is the vase tall and brown?"}, {"query": "How is the brown item of furniture called?"}, {"query": "Do you see a plate or a cup that are made of paper?"}, {"query": "Is the platter the same color as the vase?"}, {"query": "What is in front of the vase?"}, {"query": "What is the napkin in front of?"}, {"query": "What is located on top of the table?"}, {"query": "Are there napkins on top of the table?"}, {"query": "Do the napkin and the plate have a different colors?"}, {"query": "Do the plate and the table have a different colors?"}, {"query": "Is the plate on a tablecloth?"}, {"query": "What kind of furniture isn't rectangular?"}, {"query": "Is the napkin white?"}, {"query": "What is on the glass plate?"}, {"query": "What food is on the plate made of glass?"}, {"query": "What food is on the plate?"}, {"query": "Which color are the flowers, green or red?"}, {"query": "Which kind of furniture isn't metallic?"}, {"query": "What type of furniture is behind the vase?"}, {"query": "Is the saucer white and round?"}, {"query": "Which kind of furniture is the vase in front of?"}, {"query": "What is the piece of furniture that that vase is in front of?"}, {"query": "What is the vase in front of?"}, {"query": "What is in front of the shelf?"}, {"query": "Is the cracker in the top part of the picture?"}, {"query": "What kind of furniture is metallic?"}, {"query": "Do the saucer and the platter have a different shapes?"}, {"query": "Is this table rectangular and white?"}, {"query": "What is the plate made of?"}, {"query": "What kind of furniture is brown?"}, {"query": "What's the saucer made of?"}, {"query": "Is the small saucer made out of glass?"}]}
{"imageid": "n320782", "question": [{"query": "Is the vegetable to the left of the parsley both red and small?"}, {"query": "Is the meat in the sandwich large and pink?"}, {"query": "On which side is the small vegetable?"}, {"query": "What vegetables are right of the tomato?"}, {"query": "Do the vegetables near the onions have rectangular shape and orange color?"}, {"query": "What type of furniture does this napkin sit atop, a table or a bookcase?"}, {"query": "Do the carrots appear to be round?"}, {"query": "Is there a sandwich or a hot dog that is not long?"}, {"query": "Which kind of food is sitting atop the table?"}, {"query": "Is the bag below a donut?"}, {"query": "Is this napkin white and triangular?"}, {"query": "Are there any green olives or onions?"}, {"query": "Are there either any round lemons or carrots?"}, {"query": "What is the parsley in?"}, {"query": "What kind of vegetable is in the sandwich?"}, {"query": "Are there either any plates or tomatoes in this photo?"}, {"query": "Is there meat next to the vegetables that are not short?"}, {"query": "Are there any donuts above the plastic bag?"}, {"query": "What is the food on top of the bag made of plastic?"}, {"query": "What is the sandwich sitting atop?"}, {"query": "What item of furniture is the sandwich sitting atop?"}, {"query": "What color is the rectangular table?"}, {"query": "Is the white napkin to the left of the chocolate cake?"}, {"query": "What is the bag made of?"}, {"query": "What is the vegetable to the left of the onions?"}, {"query": "What vegetable is to the left of the onions?"}, {"query": "Which kind of food is above the bag?"}, {"query": "How large is the meat on the right?"}, {"query": "Is this table rectangular and yellow?"}, {"query": "How heavy is the sandwich?"}, {"query": "What is the plate to the left of the napkin sitting atop?"}, {"query": "Is the tomato to the left or to the right of the parsley?"}, {"query": "What is the plate made of?"}, {"query": "Was paper used to make the plate?"}, {"query": "What shape is the table?"}, {"query": "Is the parsley in a pizza?"}, {"query": "On which side is the green parsley?"}, {"query": "Which kind of food isn't stuffed?"}, {"query": "What shape is the napkin that is sitting atop the table?"}, {"query": "What kind of food is stuffed, the tomato or the sandwich?"}, {"query": "Are there any sandwiches or strawberries?"}, {"query": "Is the chocolate dessert in the top or in the bottom?"}]}
{"imageid": "n132388", "question": [{"query": "Who is wearing the necklace?"}, {"query": "What is the man to the right of the person holding?"}, {"query": "What is the man in front of the jacket holding, cell phones or speakers?"}, {"query": "Are there black hats or gloves?"}, {"query": "Does the hat have black color?"}, {"query": "Do you see any helmets to the left of the person that is standing on the floor?"}, {"query": "Who is wearing trousers?"}, {"query": "Which shape does the necklace have?"}, {"query": "Is the blue shirt short sleeved or long sleeved?"}, {"query": "What is the jacket that is not short sleeved made of, denim or leather?"}, {"query": "Who is the person to the left of the mobile phones looking at?"}, {"query": "Where does the standing person that to the left of the cell phones stand?"}, {"query": "Is the person that is to the left of the cell phones looking at a man?"}, {"query": "Is there a remote control or a cell phone in the image?"}, {"query": "Does the wood floor look checkered and smooth?"}, {"query": "What is the man in front of the jacket posing with?"}, {"query": "What is the man in front of the jacket holding?"}, {"query": "What are the devices that the happy man is holding?"}, {"query": "What devices is the happy man posing with?"}, {"query": "Is the jacket made of denim blue and long sleeved?"}, {"query": "Is the floor made of wood or brick?"}, {"query": "What is the person to the left of the man doing?"}, {"query": "Are there either bags or cell phones that are made of plastic?"}, {"query": "What are the cellphones that are to the right of the person made of?"}, {"query": "Are the cellphones in the bottom of the photo?"}, {"query": "Do you see a cell phone to the right of the person that is looking at the man?"}, {"query": "What type of device is to the right of the person that is to the right of the man?"}, {"query": "Is the happy man posing with printers?"}, {"query": "Who is posing with the cell phones to the right of the person?"}, {"query": "What is the man that is not sad posing with?"}, {"query": "What type of device is the man to the right of the person posing with?"}, {"query": "Is the happy man fat or skinny?"}, {"query": "Are both the floor and the necklace made of the same material?"}, {"query": "How clean is the jacket made of cloth?"}, {"query": "Which type of clothing is not plaid, the hat or the shirt?"}, {"query": "Which kind of clothing is not plaid?"}, {"query": "Is the shirt blue and long sleeved?"}, {"query": "How does the necklace look, small or large?"}, {"query": "What material is the jacket that looks gray, cloth or leather?"}, {"query": "Does the jacket that is gray seem to be lying?"}]}
{"imageid": "n267826", "question": [{"query": "Which material was used to make the water, wire or glass?"}, {"query": "Do you think the water is happy?"}, {"query": "Is the utensil to the left of the cheese covering the vegetable?"}, {"query": "The sauce is flying above what?"}, {"query": "What food is eaten?"}, {"query": "What food item in the picture is not long?"}, {"query": "What food item is not long?"}, {"query": "Is the water playing with a vegetable?"}, {"query": "Does the spoon used a hamburger?"}, {"query": "What is standing on top of the knife?"}, {"query": "What is playing at the knife?"}, {"query": "What is flying above the sauce that flies above the water?"}, {"query": "What is that glass flying above?"}, {"query": "What is flying above the water?"}, {"query": "Does the sauce seem to be having meeting?"}, {"query": "On which side is the knife?"}, {"query": "Which color does the food that the knife is inside of have?"}, {"query": "Does the spoon seem to be skiing?"}, {"query": "Does the packet stand on top of a hot dog?"}, {"query": "Is the eaten food looking at a packet?"}, {"query": "Is the knife light brown and low?"}, {"query": "Is the knife skiing?"}, {"query": "Are there any red pizzas or hot dogs?"}, {"query": "What kind of food is the knife to the right of the vegetable using?"}, {"query": "Does the water look low and happy?"}, {"query": "Is the water high?"}, {"query": "What is the pizza looking at?"}, {"query": "Does the knife look low?"}, {"query": "What kind of fast food is light brown?"}, {"query": "What kind of food is not sliced?"}, {"query": "Which seems to be healthier, the vegetable or the pizza?"}, {"query": "Is the cheese to the right of the spoon low and blue?"}, {"query": "Which kind of fast food is looking at the packet?"}, {"query": "What does the spoon used?"}, {"query": "Is the spoon on the left side of the picture?"}, {"query": "Are there either any plates or breads in the image?"}, {"query": "What type of fast food does the utensil to the left of the cheese used?"}, {"query": "Which kind of food isn't light brown?"}, {"query": "What kind of fast food is long?"}, {"query": "Which kind of food bites the water?"}, {"query": "The yellow food bites what?"}, {"query": "Is the utensil to the left of the cheese standing on top of the knife that is skiing?"}, {"query": "Is the knife biting the utensil on the left?"}, {"query": "What is using the cheese?"}, {"query": "What does the packet stand on top of?"}, {"query": "Is the knife to the left or to the right of the pizza?"}, {"query": "Is the knife to the right of the food the packet stands on top of?"}, {"query": "What stands on top of the pizza the spoon uses?"}, {"query": "What is the knife that looks silver and light brown biting?"}]}
{"imageid": "n368247", "question": [{"query": "Are there large computer mice or keyboards?"}, {"query": "What is the device on the desk called?"}, {"query": "Is the laptop above the drawer on or off?"}, {"query": "What is the name of the device above the small drawer?"}, {"query": "How large is the wood drawer?"}, {"query": "On which side of the photo is the small cup?"}, {"query": "What is the wallet on?"}, {"query": "Are there wallets next to the cup?"}, {"query": "How is the item of furniture that is made of same material as the drawer called?"}, {"query": "Are there any laptops near the device in the bottom of the image?"}, {"query": "What is the item of furniture below the desk called?"}, {"query": "Does the book look black or white?"}, {"query": "Which kind of furniture is to the right of the cell phone?"}, {"query": "What is the piece of furniture to the left of the book called?"}, {"query": "How big is the keyboard?"}, {"query": "Is the electronic keyboard on the desk black and small?"}, {"query": "Do you see any headphones in the image that are black?"}, {"query": "Are the headphones on a couch?"}, {"query": "What is the cell phone on?"}, {"query": "What device is on the desk?"}, {"query": "What color do you think is the laptop computer?"}, {"query": "Are there either any bowls or cups in the photo?"}, {"query": "What kind of device is on the desk?"}, {"query": "Which kind of furniture is not messy?"}, {"query": "Do you see both keyboards and headphones?"}, {"query": "How big is the cup that the wallet is next to?"}, {"query": "Which kind of furniture is below the desk?"}, {"query": "Is the small drawer below a desk?"}, {"query": "What device is to the left of the drawer?"}, {"query": "What is the name of the piece of furniture below the device near the cell phone?"}, {"query": "Are the headphones to the left of the keyboard on the desk?"}, {"query": "What device is to the right of the headphones on the desk?"}, {"query": "What is the item of furniture that is not cluttered called?"}, {"query": "Is the cellphone near the laptop both small and black?"}, {"query": "What kind of device is not open?"}, {"query": "Are there both a chair and a desk in the picture?"}, {"query": "Is the drawer under a desk?"}, {"query": "Does the wallet look black and small?"}, {"query": "Is the desk under a camera?"}, {"query": "Does the book look closed?"}, {"query": "What item of furniture is not cluttered?"}, {"query": "In which part of the photo are the headphones?"}, {"query": "Is it a shop?"}, {"query": "Which room is it?"}, {"query": "Which side of the picture is the leather wallet on?"}, {"query": "Which type of device is on, the cellphone or the laptop computer?"}, {"query": "What item of furniture is under the desk?"}, {"query": "What piece of furniture is under the desk?"}, {"query": "What is under the desk?"}, {"query": "What is under the cluttered desk?"}, {"query": "Is the book the same color as the wallet?"}, {"query": "Is the small cell phone in the top part or in the bottom of the image?"}, {"query": "Is the cup different in color than the book?"}, {"query": "What's the book on?"}, {"query": "Do the mobile phone and the keyboard have a different colors?"}, {"query": "Is the cup next to the wallet small and white?"}, {"query": "What kind of furniture is above the drawer?"}, {"query": "Is the drawer below the laptop computer made of plastic or wood?"}, {"query": "What item of furniture is under the laptop?"}, {"query": "Which kind of device is above the desk?"}]}
{"imageid": "n487782", "question": [{"query": "Is it an outdoors scene?"}, {"query": "Is the appliance to the right of the bottles white and dirty?"}, {"query": "Is the window white?"}, {"query": "Which kind of appliance is the spoon inside of?"}, {"query": "What is the appliance that that spoon is inside of called?"}, {"query": "Where are the wood cabinets, in the top or in the bottom of the image?"}, {"query": "Are there both bowls and spoons in this picture?"}, {"query": "Is this a mixer or a blender?"}, {"query": "Is there either a black coffee machine or mixer?"}, {"query": "Does the window made of glass look closed and green?"}, {"query": "Is the appliance behind the women black and metallic?"}, {"query": "What appliance are the women in front of?"}, {"query": "Who is in front of the appliance in the center of the photo?"}, {"query": "Who is in front of the stove?"}, {"query": "Are the women in front of the appliance that is in front of the wall?"}, {"query": "Who is inside the kitchen?"}, {"query": "On which side of the image are the closed bottles?"}, {"query": "What is the appliance behind the people to the right of the cabinets?"}, {"query": "Is the spoon inside a bowl?"}, {"query": "What kind of appliance is dirty, the stove or the mixer?"}, {"query": "What kind of appliance is dirty?"}, {"query": "What kind of appliance is not dirty?"}, {"query": "Do the cabinets look wooden and white?"}, {"query": "Do the stove and the appliance that is not clean both have white color?"}, {"query": "Which kind of appliance isn't metallic?"}, {"query": "What type of appliance is not metallic, the mixer or the stove?"}, {"query": "Are the women in front of the window made of glass?"}, {"query": "Which kind of furniture is on top of the stove?"}, {"query": "Is there any cabinet on top of the metal appliance behind them?"}, {"query": "Which kind of appliance is behind the women?"}, {"query": "Is the stove behind the people inside the kitchen?"}, {"query": "Are the window and the mixer the same color?"}, {"query": "Does the utensil that is to the right of the bottles look dirty and wooden?"}, {"query": "Who in the photograph is standing?"}, {"query": "Which kind of furniture is made of wood?"}, {"query": "Which kind of furniture is wooden?"}, {"query": "What are the pieces of furniture that are wooden?"}, {"query": "Which kind of furniture is it?"}, {"query": "How are this items of furniture called?"}, {"query": "What appliance is made of metal?"}, {"query": "What appliance is metallic?"}, {"query": "Are there men or women that are eating?"}, {"query": "What are the women doing?"}, {"query": "Who is cooking?"}, {"query": "What is located on top of the appliance in the center of the picture?"}, {"query": "What type of furniture do you think is on top of the metal stove?"}, {"query": "What is located on top of the stove?"}, {"query": "What is in front of the wall?"}, {"query": "What type of appliance is in front of the wall?"}, {"query": "Which kind of appliance is in front of the wall?"}, {"query": "Does the kitchen look small?"}, {"query": "Is the wall behind a bear?"}, {"query": "Is the window made of the same material as the spoon?"}, {"query": "What is the spoon made of?"}, {"query": "What items of furniture are to the left of the curtain?"}, {"query": "What is the name of the pieces of furniture that are to the left of the women?"}, {"query": "Is there either a mixer or a microwave in this photograph?"}, {"query": "Are the unopened bottles to the left of the mixer empty or full?"}, {"query": "How clean is the mixer near the bottles?"}, {"query": "Does the wood spoon look dirty?"}, {"query": "Is there a bottle to the left of the mixer?"}, {"query": "What appliance is the wall behind of?"}, {"query": "Is there a blender near the bottles?"}, {"query": "Is that curtain white and open?"}, {"query": "What is inside the mixer?"}, {"query": "The spoon is inside what?"}, {"query": "Are the cabinets white?"}]}
{"imageid": "n284191", "question": [{"query": "Do the tree and the street sign have the same color?"}, {"query": "Is the worker on the right?"}, {"query": "Do you see policemen behind the bus near the street sign?"}, {"query": "Are there both buses and cars in the photo?"}, {"query": "What is the traffic light in front of?"}, {"query": "Is the traffic light off or on?"}, {"query": "Does the traffic signal in front of the bus look black and rectangular?"}, {"query": "Which color is the large bus?"}, {"query": "In which part is the traffic signal?"}, {"query": "What vehicle is the traffic light in front of?"}, {"query": "Is the traffic signal in front of a bridge?"}, {"query": "Which color is the traffic light in front of the bus?"}, {"query": "On which side is the trash can?"}, {"query": "What is the trash can sitting next to?"}, {"query": "What is the small trash can sitting next to?"}, {"query": "Do you think the trashcan is rounded?"}, {"query": "What is standing behind the tree that is standing behind the bus?"}, {"query": "What is the street light standing behind of?"}, {"query": "Does the bus in front of the police officer look large and blue?"}, {"query": "Is this a bus or a train?"}, {"query": "Which color is the bus that is to the right of the other bus?"}, {"query": "Is the trashcan large and gray?"}, {"query": "How large is the trash bin that is sitting next to the street sign?"}, {"query": "Is the small trash can sitting next to the street sign?"}, {"query": "What vehicle is the policeman to the right of the worker standing behind of, a train or a bus?"}, {"query": "Does the high sign look rectangular and white?"}, {"query": "What vehicle is in front of the policeman?"}, {"query": "Is the policeman on the right or on the left of the picture?"}, {"query": "What is in front of the police officer the worker is standing by?"}, {"query": "Who is standing near the policeman?"}, {"query": "What is the sign that the small trash can is sitting next to?"}, {"query": "What is sitting next to the street sign?"}, {"query": "Who is standing behind the bus that looks blue and yellow?"}, {"query": "What is the police officer that is to the right of the worker standing behind of?"}, {"query": "What is the green tree standing behind of, a train or a bus?"}]}
{"imageid": "n275523", "question": [{"query": "Does that hat appear to be white and soft?"}, {"query": "Does the utensil that is not small look black?"}, {"query": "On which side is the plate?"}, {"query": "What is located on top of the shirt that is not dirty?"}, {"query": "He is in front of what?"}, {"query": "What is the man in front of?"}, {"query": "Is he behind a boy?"}, {"query": "Which color do you think the large serving tray is?"}, {"query": "Do you see a black knife or spoon?"}, {"query": "Is the food tray small?"}, {"query": "Are both the bowl on the shelf and the serving tray that is not little full?"}, {"query": "What is located on top of the shirt?"}, {"query": "Does the counter in front of the man look yellow and clean?"}, {"query": "Is the counter in front of him silver or tan?"}, {"query": "Is the white hat on top of him?"}, {"query": "Is the man to the left or to the right of the shelf?"}, {"query": "Do you think the bowl that is to the right of the man is blue or white?"}, {"query": "What is the item of furniture that the bowl is on called?"}, {"query": "Is the bowl on a mat?"}, {"query": "How hard is the hat?"}, {"query": "How clean is the plate?"}, {"query": "Does the spoon look large or small?"}, {"query": "Is the spoon small and silver?"}, {"query": "Does the serving tray look large and black?"}, {"query": "Is the man to the left or to the right of the food on the plate?"}, {"query": "Are there any bottles to the right of the food on the plate?"}, {"query": "What is in front of the person the sink is behind of?"}, {"query": "What is in front of the man?"}, {"query": "Who is the counter in front of?"}, {"query": "What is on the shelf?"}, {"query": "What's on the shelf?"}, {"query": "How clean is the bowl on the shelf?"}, {"query": "What is the bowl on?"}, {"query": "What's the shelf made of?"}, {"query": "Is the serving tray empty?"}, {"query": "What type of furniture is to the right of the man the hat is on top of?"}, {"query": "What is the material of the shelf to the right of the man?"}, {"query": "Who is wearing a shirt?"}, {"query": "What is the man wearing?"}, {"query": "Is the spoon in the top part of the photo?"}, {"query": "Is he to the right or to the left of the bowl on the right side?"}, {"query": "What is located on top of the man?"}, {"query": "Is the blue bowl on the right or on the left?"}, {"query": "Does the bowl look empty and blue?"}, {"query": "Do the shirt and the apron have the same color?"}]}
{"imageid": "n262370", "question": [{"query": "What is the name of the dessert to the right of the candles?"}, {"query": "Is the cardboard container empty and small?"}, {"query": "Which kind of dessert is to the right of the candles?"}, {"query": "On which side is the boy?"}, {"query": "What is the toy to the left of the plates sitting on top of?"}, {"query": "Is the sweet dessert inside the container made of cardboard?"}, {"query": "Is the young boy to the right or to the left of the plate in the bottom of the picture?"}, {"query": "Is the vanilla ice cream soft and brown?"}, {"query": "Is the ice cream soft?"}, {"query": "How old is the person that is watching the boy?"}, {"query": "What color is the utensil that is not short?"}, {"query": "Which color is the soft toy, white or blue?"}, {"query": "What do both the balloon and the cake have in common?"}, {"query": "Is the picture black and white or colorful?"}, {"query": "What is in front of the windows?"}, {"query": "How clean are the bowls to the right of the ice cream?"}, {"query": "Is the green plate square and clean?"}, {"query": "Is the stuffed animal sitting on top of a sofa?"}, {"query": "What piece of furniture is the stuffed animal sitting on top of?"}, {"query": "Who is sitting?"}, {"query": "What is the child doing?"}, {"query": "What is the toy to the right of the boy that is shown in this image?"}, {"query": "Are the bowls clean and empty?"}, {"query": "On which side of the picture is the vanilla ice cream, the right or the left?"}, {"query": "Is the colorful picture on the right side?"}, {"query": "Which shape is the table?"}, {"query": "Who blows out the candles?"}, {"query": "Are there kites or balloons that are not round?"}, {"query": "Who does the kid that to the right of the ice cream watch?"}, {"query": "Is the green plate clean or dirty?"}, {"query": "Does the shirt look blue and small?"}, {"query": "Is the color of the stuffed animal the same as the cake?"}, {"query": "Do the windows look clear and rectangular?"}, {"query": "Are the clean bowls on the right side?"}, {"query": "What is the picture in front of?"}, {"query": "Which kind of dessert is to the left of the bowls?"}, {"query": "What kind of dessert is to the left of the female person?"}, {"query": "What kind of dessert is in front of the boy?"}, {"query": "Who is the cake in front of?"}, {"query": "Are there containers to the right of the candles that are not unlit?"}, {"query": "Which color do you think the clean plate is?"}, {"query": "Is the container full?"}, {"query": "Is the young child on the left side?"}, {"query": "Are the multi colored books to the right of the balloon standing against the windows?"}, {"query": "What is standing against the windows?"}, {"query": "Are the small plates white and round?"}, {"query": "What dessert is inside the container?"}, {"query": "What is the dessert inside the container that is not big called?"}, {"query": "Are there remote controls on top of the table next to the windows?"}, {"query": "Are the clean bowls to the right of a spoon?"}, {"query": "Do the windows appear to be closed?"}, {"query": "Which side is the plastic spoon on?"}, {"query": "Which size is the full container, small or large?"}, {"query": "What is the spoon that is not short made of?"}, {"query": "How old is the person on the left?"}, {"query": "Does the person to the right of the stuffed animal look female?"}, {"query": "What is inside the container?"}, {"query": "What is inside the small container?"}, {"query": "Are there cabinets to the left of the white plates?"}, {"query": "Are the bowls that are not dirty empty or full?"}, {"query": "What is sitting on top of the table?"}, {"query": "Who watches the person the cake in front of?"}, {"query": "Is the container on the right side or on the left?"}, {"query": "Does the boy appear to be old and happy?"}, {"query": "Are there silver forks or spoons?"}, {"query": "Who in the scene is sitting?"}, {"query": "The cake is in front of who?"}, {"query": "Who does the child watch?"}, {"query": "Is the young boy to the right or to the left of the plates that are not large?"}, {"query": "Is the toy which is to the right of the boy white and soft?"}, {"query": "Is the clean plate to the right or to the left of the boy that is not sad?"}, {"query": "Is there a balloon near the windows?"}]}
{"imageid": "n474949", "question": [{"query": "Does the paper container look black and open?"}, {"query": "What is she doing?"}, {"query": "On which side are the glasses?"}, {"query": "How thick are the black glasses?"}, {"query": "Who is wearing an earring?"}, {"query": "Are there both a cabinet and a table in this picture?"}, {"query": "Are there either any forks or spoons that are made of plastic?"}, {"query": "Does she look old and long sleeved?"}, {"query": "Is the cup on top of the table made of glass or Styrofoam?"}, {"query": "Who in the image is looking up?"}, {"query": "What is the size of the pizza the woman is holding?"}, {"query": "What is the food that this woman is holding?"}, {"query": "Is the plate on top of the table empty or full?"}, {"query": "On which side of the image is the cup?"}, {"query": "Do you see any plates or breads?"}, {"query": "What is the young woman doing, cooking or looking up?"}, {"query": "What is the color of the container on top of the table?"}, {"query": "Are there any boys or women?"}, {"query": "Is that fork made of stainless steel?"}, {"query": "Is the black object on top of the table closed or open?"}]}
{"imageid": "n23037", "question": [{"query": "Are the glasses to the left or to the right of the lady?"}, {"query": "How old is the person the boy is to the left of?"}, {"query": "Who is talking to the lady?"}, {"query": "The boy that is not short is talking to who?"}, {"query": "Who is the boy talking to?"}, {"query": "What is the woman wearing?"}, {"query": "What is the short woman wearing?"}, {"query": "How large is the old shirt?"}, {"query": "What is the name of the light item of clothing?"}, {"query": "Do you see ladies to the right of the boy?"}, {"query": "Do you see both an umbrella and a bike?"}, {"query": "Is the jacket dark?"}, {"query": "What is the man wearing?"}, {"query": "Are the earrings old or new?"}, {"query": "Is the black watch old or new?"}, {"query": "On which side of the image is the lady?"}, {"query": "Are all the people female?"}, {"query": "What kind of clothing isn't light?"}, {"query": "Is the man that is not old holding a camera?"}, {"query": "What is the man holding?"}, {"query": "What is the person that is not small holding?"}, {"query": "Which side of the image is the young boy on?"}, {"query": "Does the lady look tall?"}, {"query": "Are the glasses that are not thick new and small?"}, {"query": "Is the hat blue and old?"}, {"query": "What is the material of the black watch?"}, {"query": "Which is older, the woman or the lady?"}, {"query": "Is the man to the right or to the left of the woman?"}, {"query": "Is the woman happy and short?"}, {"query": "Is this a short woman?"}, {"query": "Which kind of clothing isn't wet?"}, {"query": "Is the man to the right of a bag?"}, {"query": "Who is the happy woman holding?"}, {"query": "Is the young man wearing a watch?"}, {"query": "Is there a dog near the young man?"}, {"query": "Is the shirt that is not dry black or red?"}, {"query": "What is the man doing?"}, {"query": "Is this man old?"}, {"query": "How fat is the young boy?"}, {"query": "Does the jacket have a different color than the hat?"}, {"query": "What is the color of the umbrella the man is holding?"}, {"query": "Is the large umbrella black and new?"}, {"query": "Does the person that is looking up look happy and small?"}, {"query": "Who is holding the umbrella that is not small?"}, {"query": "Does the watch made of leather have silver color?"}, {"query": "What is common to the building and the umbrella?"}, {"query": "Is the person that looks skinny tall or short?"}, {"query": "Who is wearing a hat?"}, {"query": "The skinny person is wearing what?"}, {"query": "What's the boy wearing?"}, {"query": "Is the woman smiling at the large person?"}, {"query": "At who is the person that is not tall smiling?"}, {"query": "What is the watch made of?"}, {"query": "Is the skinny person to the left or to the right of the small glasses?"}, {"query": "Does the blue hat look new or old?"}, {"query": "Is the person next to the woman large or small?"}, {"query": "Is the large umbrella in the bottom or in the top of the image?"}]}
{"imageid": "n74463", "question": [{"query": "What is located on top of the table?"}, {"query": "Is that shirt long sleeved or short sleeved?"}, {"query": "What is located on top of the table the sofa is behind of?"}, {"query": "Who is wearing a shirt?"}, {"query": "What color is the armchair that is next to the clothes?"}, {"query": "What's the table in front of?"}, {"query": "How is the item of furniture that the table is in front of called?"}, {"query": "Does the device have the same color as the sofa?"}, {"query": "What is located on top of the sofa on the right?"}, {"query": "Is the person next to the boy blond and small?"}, {"query": "Which kind of furniture is the boy in front of?"}, {"query": "What type of furniture is this boy in front of?"}, {"query": "Who is in front of the armchair?"}, {"query": "Does that armchair look short or tall?"}, {"query": "Do you see either a pillow or a bike?"}, {"query": "What kind of furniture do you think is to the left of the table lamp?"}, {"query": "Is the armchair to the left of the table lamp?"}, {"query": "What is the tissue box in front of?"}, {"query": "Is the tissue box in front of the table lamp?"}, {"query": "What is in front of the table lamp near the pillow?"}, {"query": "On which side of the image is the blue pillow?"}, {"query": "Which kind of furniture is not elongated?"}, {"query": "What kind of furniture isn't wooden?"}, {"query": "What color is the flat pillow near the table lamp?"}, {"query": "Are there any sofas near the table?"}, {"query": "Does the shirt look green and short sleeved?"}, {"query": "What is the piece of furniture that is red?"}, {"query": "Which kind of furniture isn't tall?"}, {"query": "Which kind of furniture is red?"}, {"query": "Are there any tissue boxes near the armchair?"}, {"query": "What kind of furniture is the table in front of?"}, {"query": "Who is in front of the clothes near the armchair?"}, {"query": "Who is in front of the clothes?"}, {"query": "Is the girl to the left or to the right of the person who is in front of the clothes?"}, {"query": "Which kind of furniture is not low?"}, {"query": "How is the piece of furniture that is the same color as the pillow that is to the right of the boy called?"}, {"query": "Do the device and the table lamp have the same color?"}, {"query": "Which kind of furniture is in front of the sofa?"}, {"query": "What color is the shirt?"}, {"query": "What shape is the tissue box?"}, {"query": "What kind of furniture is tall?"}, {"query": "What kind of furniture is tall, the table or the armchair?"}, {"query": "Are both the tissue box and the table lamp small?"}, {"query": "Is the table low and wooden?"}, {"query": "Is the girl on the right side?"}, {"query": "Is the boy to the left of a table lamp?"}, {"query": "Do you see any boys near the person on the left?"}, {"query": "What is the name of the item of furniture behind the boy?"}, {"query": "On which side of the image is the blue sofa?"}, {"query": "Is the sofa wide and blue?"}, {"query": "Are there tables next to the sofa the pillow is on top of?"}, {"query": "Does the shirt have the same color as the armchair?"}, {"query": "Are both the device and the table made of the same material?"}, {"query": "Is the blue pillow to the left or to the right of the boy?"}, {"query": "Which kind of furniture is blue?"}, {"query": "Which kind of furniture is blue, the table or the sofa?"}, {"query": "What is the table made of?"}, {"query": "Who is holding the device that looks white?"}, {"query": "Who is holding the device?"}, {"query": "Do you see any armchairs next to the clothes?"}, {"query": "Are there houses behind the young person?"}, {"query": "What kind of furniture is behind the boy?"}, {"query": "Which kind of furniture is wide?"}, {"query": "Which kind of furniture isn't blue?"}, {"query": "What type of furniture is not blue?"}, {"query": "What type of furniture is to the right of the boy?"}, {"query": "The table is in front of what?"}, {"query": "Does the table lamp look small and white?"}, {"query": "On which side is the table lamp?"}, {"query": "What is the device made of?"}, {"query": "What type of material is the device made out of?"}, {"query": "Who is walking?"}, {"query": "Does the person to the left of the armchair seem to be walking?"}, {"query": "Are the armchair and the device the same color?"}]}
{"imageid": "n277276", "question": [{"query": "Do the trousers look gray and short?"}, {"query": "Are the trousers that are not short red or gray?"}, {"query": "Is the tennis racket in the top part or in the bottom of the picture?"}, {"query": "Are there either carts or baseball bats in the photo?"}, {"query": "Are the shorts khaki?"}, {"query": "Is the net different in color than the building?"}, {"query": "Does the racket look small?"}, {"query": "Does the tennis racket look colorful?"}, {"query": "What is the color of the net?"}, {"query": "Is the tennis racket to the right of the man black and white and small?"}, {"query": "Is the racket to the left or to the right of the man that is wearing shorts?"}, {"query": "How does the white shirt look, long sleeved or short sleeved?"}]}
{"imageid": "n231809", "question": [{"query": "Which kind of furniture is the door behind of?"}, {"query": "Is the elderly man wearing a hat?"}, {"query": "Who is wearing a shoe?"}, {"query": "Does the bottle that is to the right of the bowl have pink color?"}, {"query": "Is the bottle that looks green sitting on a shelf?"}, {"query": "Is the tall vase to the right or to the left of the blue bowl?"}, {"query": "Is the bottle that looks green made of plastic?"}, {"query": "Are there both a bed and a chair in the image?"}, {"query": "What is the item of furniture that the door is behind of?"}, {"query": "Are there either black windows or doors?"}, {"query": "Is there a bottle to the left of the white bowl?"}, {"query": "What type of furniture is the same color as the door?"}, {"query": "Do the shelf and the door have the same color?"}, {"query": "Is the cable different in color than the door?"}, {"query": "What color is the bowl on the right?"}, {"query": "What is the length of the blue bowl?"}, {"query": "Is the tall bottle sitting on a cabinet?"}, {"query": "What is sitting under the table?"}, {"query": "What are the boxes sitting under?"}, {"query": "Are the boxes made of cardboard sitting under a nightstand?"}, {"query": "Who is wearing jeans?"}, {"query": "How hard is the shelf?"}, {"query": "What is the piece of furniture above the table?"}, {"query": "Does the bottle to the right of the bowl seem to be thin and white?"}, {"query": "Do you see any bottles that are not made of plastic?"}, {"query": "Which kind of clothing is long sleeved?"}, {"query": "What is under the shelf?"}, {"query": "Does the bowl to the left of the other bowl look narrow and colorful?"}, {"query": "Is the red bottle made of plastic?"}, {"query": "What kind of furniture is the red bottle sitting on?"}, {"query": "What is the bottle that looks red sitting on?"}, {"query": "Does the table have a different color than the cable?"}, {"query": "Do the vases to the left of the bottle sit on a cabinet?"}, {"query": "Is the blue bowl to the left or to the right of the vase that is not short?"}, {"query": "Are there bowls to the left of the vase on the right side?"}, {"query": "Do the vases that look white and blue look covered?"}, {"query": "Are there any glasses or bottles?"}, {"query": "Is there a white bottle or chair?"}, {"query": "Are there both bottles and bowls in the scene?"}, {"query": "What size is the bowl that looks beige?"}, {"query": "Is the bottle to the left of the bowl both blue and thin?"}, {"query": "Does the red bottle look fat?"}, {"query": "Are there either tables or lamps that are not black?"}, {"query": "Is the bowl to the right of the bottle white and short?"}, {"query": "Is the bowl to the right of the other bowl blue and short?"}, {"query": "Who is standing in front of the table?"}, {"query": "Are there any bottles in the image that are blue?"}, {"query": "Are there glass bowls or bottles?"}, {"query": "Does this man hold onto a wine glass?"}, {"query": "What is the chair in front of?"}, {"query": "The chair is in front of what?"}, {"query": "Which kind of furniture is in front of the door?"}, {"query": "What is the piece of furniture that is in front of the white door called?"}, {"query": "Is the hanging shelf above the table?"}, {"query": "Is the tall vase to the right or to the left of the wide bowl?"}, {"query": "Which color is the thin bottle that is to the left of the bowl?"}, {"query": "Does the vase that looks blue and white look striped?"}, {"query": "Are there doors in the picture?"}, {"query": "How long is the white bowl?"}, {"query": "Which kind of furniture is black?"}, {"query": "Which side of the picture is the chair on?"}, {"query": "What is the item of furniture under the shelf the bottle is sitting on?"}, {"query": "What is under the hanging shelf?"}, {"query": "What is the green bottle sitting on?"}, {"query": "How fat is the green bottle?"}, {"query": "Is the black vase to the right of a bowl?"}, {"query": "Does the sweater that is not short sleeved look red or gray?"}, {"query": "What is the white bowl sitting on?"}, {"query": "Is there a glass bottle?"}]}
{"imageid": "n311632", "question": [{"query": "What is the fat person doing?"}, {"query": "Are the tall trees bare or lush?"}, {"query": "What color are the trees behind the wall?"}, {"query": "Is there a desk in this photo?"}, {"query": "Is the mobile phone on the right side?"}, {"query": "Where is the man that is not thin standing on?"}, {"query": "Does the concrete path have long length and red color?"}, {"query": "Is the happy person to the left or to the right of the fat person?"}, {"query": "Where is the smiling woman that is to the left of the tablet standing on?"}, {"query": "Are the green trees leafless or lush?"}, {"query": "Who is holding the cell phone?"}, {"query": "What is the person that looks blond holding?"}, {"query": "What clothing item is formal?"}, {"query": "Which kind of clothing is comfortable?"}, {"query": "What size is the metal device?"}, {"query": "Who is walking?"}, {"query": "What are the people that are to the right of the man doing?"}, {"query": "What is the name of the item of clothing that is white?"}, {"query": "What are the eye glasses made of?"}, {"query": "Is the fat person to the right or to the left of the person that is wearing jeans?"}, {"query": "What clothing item is plush?"}, {"query": "What item of clothing is white?"}, {"query": "What is the tablet made of?"}, {"query": "Is the man to the left or to the right of the walking people that are walking on the path?"}, {"query": "On which side of the photo is the happy person?"}, {"query": "Is the path made of the same material as the tablet?"}, {"query": "Is the woman that is not sad wearing glasses?"}, {"query": "Where is the man standing on?"}, {"query": "What is the woman doing?"}, {"query": "What is the person that is not sad doing?"}, {"query": "Which shape is the tablet?"}, {"query": "What is the device that the man is holding?"}, {"query": "The fat man is holding what?"}, {"query": "Are there either black televisions or cell phones?"}, {"query": "Where are the people that are walking walking?"}, {"query": "What device has the same color as the wool sweater?"}, {"query": "Are both the wall and the path made of the same material?"}, {"query": "What is the man holding?"}, {"query": "What kind of device is to the left of the man?"}, {"query": "What is the color of the grass?"}, {"query": "Is this woman Caucasian and blond?"}, {"query": "Is the man to the left or to the right of the device that is not antique?"}, {"query": "Who is posing?"}, {"query": "What kind of device is to the right of the woman?"}, {"query": "Are the concrete buildings both orange and tall?"}, {"query": "What are the buildings made of?"}, {"query": "How clean is the jacket that the man is wearing?"}, {"query": "What is the man in front of?"}, {"query": "Is the man to the left of glasses?"}, {"query": "What kind of clothing is black?"}, {"query": "Who is holding the device to the right of the woman?"}, {"query": "Who do you think is wearing a bracelet?"}, {"query": "Do the buildings that are not short have orange color?"}, {"query": "How is the black clothing item called?"}, {"query": "What kind of clothing is clean?"}]}
{"imageid": "n59599", "question": [{"query": "How large is the fence in front of the building?"}, {"query": "How tall is the soccer player on the left side?"}, {"query": "Is the small building behind the blue fence that is behind the goal?"}, {"query": "Who is wearing shorts?"}, {"query": "What is the soccer player that is running doing?"}, {"query": "Do the goal and the soccer ball have the same color?"}, {"query": "Is it outdoors or indoors?"}, {"query": "What do you think is in front of the fence that is in front of the building?"}, {"query": "Who is standing?"}, {"query": "What is in front of the small building?"}, {"query": "Who is wearing shoes?"}, {"query": "Who is wearing a jersey?"}, {"query": "Is the soccer ball near the soccer player large or small?"}, {"query": "Is the soccer ball near the soccer player white and small?"}, {"query": "Is the fence blue and small?"}, {"query": "Who is staring?"}, {"query": "Do you see either any small statues or soccer balls?"}, {"query": "What do you think is the color of that field?"}, {"query": "Does the soccer player near the soccer ball seem to be staring?"}, {"query": "Is the soccer ball in the bottom or in the top part of the photo?"}, {"query": "Does the fence behind the goal look black or blue?"}, {"query": "What is in front of the building that is not little?"}, {"query": "Who is running?"}, {"query": "What is the goal in front of?"}, {"query": "What's in front of the fence?"}, {"query": "What color does the jersey that is not short sleeved have?"}, {"query": "Is the protective fence behind the goal?"}, {"query": "Who is waiting?"}, {"query": "Which gender is the soccer player on the right side?"}, {"query": "Who wears a jersey?"}, {"query": "Who wears shoes?"}]}
{"imageid": "n485183", "question": [{"query": "Where is it?"}, {"query": "What is on the parking meter the car is behind of?"}, {"query": "What is on the parking meter?"}, {"query": "Is the screen to the left or to the right of the vehicle behind the meter?"}, {"query": "What kind of vehicle is behind the parking meter?"}, {"query": "What is on the sidewalk?"}, {"query": "Is the pole in front of the doors made out of wood?"}, {"query": "What is the screen on?"}, {"query": "Is the silver car to the left of a parking meter?"}, {"query": "Are there any glasses or elephants in the scene?"}, {"query": "Are the doors behind the pole?"}, {"query": "Is the parking meter modern?"}, {"query": "Does the parking meter in front of the car look black and modern?"}, {"query": "What is in front of the doors?"}, {"query": "What's the pole in front of?"}, {"query": "The pole is in front of what?"}, {"query": "What is the device to the right of the silver car?"}, {"query": "What makes up the sidewalk next to the road, concrete or cobblestone?"}, {"query": "Is the side walk snowy or grassy?"}, {"query": "What is the color of the vehicle behind the meter?"}, {"query": "Which side is the car on?"}, {"query": "What kind of vehicle is the parking meter in front of?"}, {"query": "What is common to the trunk and the light post?"}, {"query": "Are the doors brown or white?"}, {"query": "Is there a fire hydrant on the sidewalk next to the road?"}, {"query": "What is on the side walk that is next to the road?"}, {"query": "Is the sidewalk made of concrete both gray and grassy?"}, {"query": "What color does the sidewalk have?"}, {"query": "What are the doors made of?"}, {"query": "What material are the doors made of?"}, {"query": "Is the meter to the left of the car that is on the left side of the image?"}, {"query": "What is in front of the car?"}, {"query": "What is in front of the silver car?"}, {"query": "What color is the meter that is next to the road?"}]}
{"imageid": "n471447", "question": [{"query": "Do the socks look white and long?"}, {"query": "What color is the soccer ball near the soccer player?"}, {"query": "What is the long sleeved clothing item?"}, {"query": "Which kind of clothing is clean?"}, {"query": "Which kind of clothing is long sleeved?"}, {"query": "Who is wearing a jersey?"}, {"query": "Who is wearing the jersey?"}, {"query": "Who is wearing shorts?"}, {"query": "Who is wearing the shorts?"}, {"query": "Is the soccer ball the same color as the jersey?"}, {"query": "Are the soccer shorts both striped and white?"}, {"query": "Who is the jersey worn on?"}, {"query": "How long are the socks that are worn on the soccer player?"}, {"query": "Who are the socks worn on?"}, {"query": "Who is wearing the socks?"}, {"query": "Who is wearing socks?"}, {"query": "Who are the shorts that are white worn on?"}, {"query": "Who are the shorts worn on?"}, {"query": "Who is staring?"}, {"query": "Is the soccer jersey red and clean?"}, {"query": "Which place is it?"}, {"query": "Is the jersey that looks white and red short sleeved or long sleeved?"}]}
{"imageid": "n436834", "question": [{"query": "Which material makes up the sink?"}, {"query": "What is the sink made of?"}, {"query": "What color is the tray the machine is holding?"}, {"query": "What is in front of the machine?"}, {"query": "What is the machine holding?"}, {"query": "Is the large machine holding the tray in the middle?"}, {"query": "How big is the tray?"}, {"query": "Is the white machine behind a fire extinguisher?"}, {"query": "What is in front of the window?"}, {"query": "What's in front of the window?"}, {"query": "Is the tray gray and large?"}, {"query": "Is the trash bag made of the same material as the machine?"}, {"query": "What do the window and the machine have in common?"}, {"query": "What do both the sink and the machine have in common?"}, {"query": "Is the trash bag teal and small?"}, {"query": "What's in front of the sink?"}, {"query": "What is in front of the sink?"}, {"query": "How is the bag in front of the sink made of metal called?"}, {"query": "What's the fire extinguisher in front of?"}, {"query": "What is the trash bag in front of?"}, {"query": "What is the size of the extinguisher the trash bag is next to?"}, {"query": "Is there either any trash bag or mirror in the image?"}, {"query": "What color does the bag that is next to the fire extinguisher have?"}, {"query": "What is holding the tray?"}, {"query": "What bag is the sink behind of?"}, {"query": "Does the window look square and red?"}]}
{"imageid": "n260369", "question": [{"query": "Is she to the right or to the left of the black bike?"}, {"query": "Is the color of the bulb different than the skirt?"}, {"query": "Is the skirt small or large?"}, {"query": "Is the color of the license plate black?"}, {"query": "Is the license plate made of metal black and square?"}, {"query": "What is under the skirt?"}, {"query": "Who is standing near the bike?"}, {"query": "Do the mirror and the bike have the same color?"}, {"query": "Do the mirror and the bulb have a different colors?"}, {"query": "Is the skirt below the dress shirt black and small?"}, {"query": "Is the bike to the right of her?"}, {"query": "Is the covered helmet round and red?"}, {"query": "Is the black skirt above the leather shoe?"}, {"query": "Is the skirt below the dress shirt that is worn on the girl?"}, {"query": "What's she doing?"}, {"query": "Is the helmet the same color as the shoe?"}, {"query": "Who is standing?"}, {"query": "Is the dress shirt made of wool pink and short sleeved?"}, {"query": "Is the bulb round?"}, {"query": "Is the dress shirt made of wool worn on her?"}, {"query": "Who is the dress shirt worn on?"}, {"query": "What is worn on the standing person that is standing near the bike?"}, {"query": "Is the light bulb on the right?"}, {"query": "What shape is the license plate that looks black and yellow?"}, {"query": "Is the light bulb both round and red?"}, {"query": "Does the shoe look small and black?"}, {"query": "Are the mirror and the bulb both small?"}, {"query": "What's standing near the girl?"}, {"query": "Is the dress shirt that looks pink made of wool?"}, {"query": "Is the mirror below the helmet both white and large?"}]}
{"imageid": "n268934", "question": [{"query": "Are the trees in front of the mountain tall and green?"}, {"query": "Is the motorcycle that looks red on or off?"}, {"query": "What color is the motorbike on the left of the image?"}, {"query": "Are there either any motorcycles or ropes in this image?"}, {"query": "Is the bicyclist standing on the brown dirt?"}, {"query": "Who is standing on the dirt that is shown in the picture?"}, {"query": "Where is the person behind the motorcycle standing on?"}, {"query": "Where is the cyclist standing on?"}, {"query": "The trees are in front of what?"}, {"query": "Is the cyclist behind a motorcycle?"}, {"query": "What is the person behind the motorbike doing?"}, {"query": "What's in front of the cyclist?"}, {"query": "Does the motorcycle to the right of the bicyclist look gray?"}, {"query": "Do you see umpires or farmers in the image?"}, {"query": "Does the person behind the motorbike appear to be standing?"}, {"query": "What are the trees in front of?"}, {"query": "Who is standing?"}, {"query": "Who is staring?"}, {"query": "What is the cyclist doing?"}, {"query": "Do the motorbike to the right of the cyclist and the red motorcycle both seem to be off?"}, {"query": "Is the dirt hard and brown?"}, {"query": "How hard is the dirt?"}]}
{"imageid": "n473734", "question": [{"query": "What color is the hat that is made of cotton?"}, {"query": "What kind of clothing is short sleeved?"}, {"query": "Which kind of clothing is short sleeved, the polo shirt or the sock?"}, {"query": "Which type of clothing is not short sleeved?"}, {"query": "What kind of clothing is not short sleeved?"}, {"query": "Is the person that is not tall hitting the ball?"}, {"query": "What is the man hitting?"}, {"query": "What is the person that is not tall hitting?"}, {"query": "What ethnic group is this man?"}, {"query": "What is he holding onto?"}, {"query": "Who is holding onto the racket?"}, {"query": "Does that ball look large?"}, {"query": "Are there large frisbees or balls?"}, {"query": "Does the person that is not tall wear a helmet?"}, {"query": "What is the racket made of?"}, {"query": "Is the man short and Asian?"}, {"query": "Is he swinging a baseball bat?"}, {"query": "Do the shorts look gray or purple?"}, {"query": "Are both the gray polo shirt and the hat that is not dirty made of cotton?"}, {"query": "Which side is the ball on?"}, {"query": "What is the height of that man?"}, {"query": "Which kind of clothing is bright?"}, {"query": "Does the polo shirt that is made of cotton look bright and gray?"}, {"query": "Is the racket large?"}, {"query": "Who is playing?"}, {"query": "Who is wearing a polo shirt?"}, {"query": "Is the ball round and red?"}]}
{"imageid": "n82183", "question": [{"query": "What is the color of the car near the people?"}, {"query": "What is the toy to the right of the dark cars?"}, {"query": "What are the vehicles on the road called?"}, {"query": "What type of vehicle is on the road?"}, {"query": "Do you think the window is tinted?"}, {"query": "Do the people near the car seem to be walking?"}, {"query": "What vehicles are to the left of the toy near the window?"}, {"query": "What vehicles are to the left of the teddy bear?"}, {"query": "Which kind of vehicle is on the road?"}]}
{"imageid": "n567537", "question": [{"query": "Who is wearing a shoe?"}, {"query": "Who is standing?"}, {"query": "Are there any napkins or cups in this image?"}, {"query": "Is the old man to the right or to the left of the cup next to the woman?"}, {"query": "What is the skinny man wearing?"}, {"query": "What does the man to the left of the cup eat?"}, {"query": "Is the woman to the right or to the left of the man that looks skinny?"}, {"query": "Does the man behind the other man look Asian?"}, {"query": "Does the Asian man appear to be eating?"}, {"query": "Is the man in front of the woman old or young?"}, {"query": "Is the woman in front or behind the short man?"}, {"query": "Does the skinny man look old?"}, {"query": "On which side is the blond woman?"}, {"query": "Is the cup to the left of the man made of plastic?"}, {"query": "Is the man to the left of the cup both skinny and old?"}, {"query": "Does the cup made of paper have red color?"}, {"query": "Is the woman in front of the man that is not tall?"}, {"query": "Do these people all have the same gender?"}, {"query": "Is the hot dog to the right or to the left of the old man?"}, {"query": "What is the food that the skinny man eats?"}, {"query": "How tall is the man the woman is in front of?"}, {"query": "Is there a bread to the right of the cooked food?"}, {"query": "Are there men to the left of the cup made of paper?"}]}
{"imageid": "n250840", "question": [{"query": "Is the young man in front of the sticky notes that are to the left of the glasses?"}, {"query": "What is in front of the man that is to the left of the sticky notes?"}, {"query": "What device do you think is in front of the man the sticky notes are to the right of?"}, {"query": "What type of material is the laptop near the glass made of?"}, {"query": "What is the device that is above the table called?"}, {"query": "Are there any laptops in front of the man that is to the left of the coffee mug?"}, {"query": "Are there any small doors or windows?"}, {"query": "How large is the window?"}, {"query": "What color is the man that is not old?"}, {"query": "What kind of furniture is underneath the coffee mug?"}, {"query": "What is in front of the young man that is wearing glasses?"}, {"query": "What kind of device is in front of the man that is wearing glasses?"}, {"query": "In which part of the image is the laptop computer, the top or the bottom?"}, {"query": "Do you see men in front of the small laptop?"}, {"query": "Do you see a laptop that is not made out of plastic?"}, {"query": "Is the apple laptop behind a man?"}, {"query": "Who is sitting at the table?"}, {"query": "Is the man to the left of the coffee mug sitting at a couch?"}, {"query": "What do you think is the piece of furniture that the young man in front of the sticky notes is sitting at called?"}, {"query": "What do you think is underneath the laptop computer the coffee mug is to the left of?"}, {"query": "Do you see a table that is not wide?"}, {"query": "Does the table look covered and wide?"}, {"query": "Does the man that looks blond wear glasses?"}, {"query": "Is the young man to the right or to the left of the coffee mug?"}, {"query": "What is the device that is to the left of the young man?"}, {"query": "How is the device that the man to the left of the sticky notes is working on called?"}, {"query": "What is the window frame holding?"}, {"query": "What is the item of furniture below the coffee mug?"}, {"query": "What item of furniture is underneath the glass near the laptop computer?"}, {"query": "Is the covered table below a laptop?"}, {"query": "Is the coffee mug on the right?"}, {"query": "The man in front of the sticky notes wears what?"}, {"query": "What size is the laptop the coffee mug is to the left of?"}, {"query": "What is holding the window?"}, {"query": "What's underneath the coffee mug?"}, {"query": "Is the small laptop in the top or in the bottom?"}, {"query": "What's the coffee mug made of?"}, {"query": "Which type of material is the coffee mug made of?"}, {"query": "The sticky notes the man is in front of have which color?"}, {"query": "Are the sticky notes to the left of the young man?"}, {"query": "What is the man in front of the sticky notes working on?"}, {"query": "Is there a laptop above the table?"}, {"query": "What's the window made of?"}, {"query": "What kind of device is above the table?"}]}
{"imageid": "n94854", "question": [{"query": "Is the grass behind a boy?"}, {"query": "Does the grass look dry and green?"}, {"query": "What is on the dry mound?"}, {"query": "What is on the mound?"}, {"query": "Is the pitcher small?"}, {"query": "What is the black shirt worn on?"}, {"query": "What is in front of the grass?"}, {"query": "Who is the bat in front of?"}, {"query": "What's in front of the grass?"}, {"query": "Are the pants dirty and white?"}, {"query": "Does the dirt look hard and white?"}, {"query": "How hard is that dirt?"}, {"query": "Is the bat in front of a batter?"}, {"query": "What color are the dirty pants?"}, {"query": "Who is looking up?"}, {"query": "What is the batter doing?"}, {"query": "Who is on top of the brown dirt?"}, {"query": "What is in front of the batter?"}, {"query": "What is the shirt worn on?"}, {"query": "What color is the shirt that is worn on the pitcher?"}, {"query": "Are there any batters to the right of the helmet?"}, {"query": "Who is on top of the dirt?"}]}
{"imageid": "n131948", "question": [{"query": "Of what color is the meat?"}, {"query": "What is the name of the brown piece of furniture?"}, {"query": "Which kind of furniture is this, a table or a nightstand?"}, {"query": "Does this broccoli look steamed?"}, {"query": "What kind of food is gray?"}, {"query": "What is the food that is gray called?"}, {"query": "Which kind of food is seasoned?"}, {"query": "Is the meat covered and dark brown?"}, {"query": "What is the meat in front of?"}, {"query": "What is the vegetable that the meat is in front of?"}, {"query": "Is the steamed broccoli in the top or in the bottom?"}, {"query": "Which kind of food isn't seasoned?"}, {"query": "Is this pasta or rice?"}, {"query": "What kind of food is cut, the meat or the broccoli?"}, {"query": "Which kind of vegetable is cut?"}, {"query": "Is this broccoli or lettuce?"}, {"query": "What vegetable is to the left of the meat?"}, {"query": "Is the avocado on top of soup?"}, {"query": "Is there any yellow pasta or rice?"}, {"query": "What color is the food with the avocado?"}, {"query": "What is located on top of the table?"}, {"query": "What's located on top of the table?"}, {"query": "Which kind of vegetable is behind the meat?"}, {"query": "Which kind of vegetable is on top of the rice?"}, {"query": "What is the vegetable on top of the food that looks gray?"}, {"query": "Which kind of food is not steamed?"}, {"query": "What is the food that the broccoli is behind of?"}, {"query": "What kind of food is the broccoli behind of?"}, {"query": "Is there any milk on top of the meat that is on top of the rice?"}, {"query": "What food is in front of the broccoli?"}, {"query": "What is the vegetable that is sliced called?"}, {"query": "What vegetable is sliced?"}, {"query": "Are there any plates to the left of the meat?"}, {"query": "Are there both rice and meat in this photo?"}, {"query": "What is located on top of the meat?"}]}
{"imageid": "n214125", "question": [{"query": "Are the Wii controllers in front of a Wii?"}, {"query": "Which kind of device are the Wii controllers in front of?"}, {"query": "What is in front of the Wii?"}, {"query": "Is the Wii behind keyboards?"}, {"query": "What kind of device is to the right of the monitor?"}, {"query": "What is the device in front of the blue wall?"}, {"query": "What kind of device is in front of the wall?"}, {"query": "What is in front of the wall?"}, {"query": "What's in front of the wall?"}, {"query": "Are the Wii remotes in front of the Wii off or on?"}, {"query": "What devices is the Wii behind of?"}, {"query": "What is the Wii behind of, headphones or Wii controllers?"}, {"query": "Which kind of device is behind the Wii controllers?"}, {"query": "Is the screen off?"}, {"query": "What type of device is old, the monitor or the Wii?"}, {"query": "Does the wire have the same color as the Wii?"}, {"query": "Are there either any desks or phones?"}, {"query": "What is the black wire plugged into?"}, {"query": "What is plugged into the device the video games are next to?"}, {"query": "What device is the wire plugged into?"}, {"query": "Are the screen and the Wii both off?"}, {"query": "Which kind of device is attached?"}, {"query": "Which type of device is attached, the Wii or the screen?"}, {"query": "What is the device that is attached called?"}, {"query": "What kind of device is not attached?"}, {"query": "Do you see both Wii controllers and glasses?"}, {"query": "Is that monitor to the left of a computer?"}, {"query": "What is the device to the right of the screen that is not on?"}, {"query": "Which kind of device is to the left of the Wii?"}, {"query": "Are there wiis near the video games that are not horizontal?"}, {"query": "Are both the monitor and the device near the video games off?"}, {"query": "Which kind of device isn't old?"}, {"query": "Does the Wii near the monitor seem to be on?"}, {"query": "Are the Wii controllers on the left or on the right?"}, {"query": "What device is the wall behind of, a Wii or a laptop?"}, {"query": "What device is the wall behind of?"}, {"query": "What are the Wii controllers in front of?"}, {"query": "What devices are in front of the device near the video games?"}, {"query": "What devices are in front of the Wii?"}, {"query": "Is there any desk or chair in the photograph?"}, {"query": "What the device that is old is called?"}, {"query": "Are there any wiis near the monitor?"}]}
{"imageid": "n296496", "question": [{"query": "Is the toothbrush dirty?"}, {"query": "Is the color of the toy the same as the toothbrush?"}, {"query": "Is the toothbrush to the right of the kid clean and white?"}, {"query": "What is the toy made of?"}, {"query": "The adult person is holding what?"}, {"query": "Do the shorts look large and brown?"}, {"query": "Does the toothbrush have blue color?"}, {"query": "Who is wearing the shorts?"}, {"query": "Who is wearing shorts?"}, {"query": "Who touches the toothbrush?"}, {"query": "Which color is the toy?"}, {"query": "Are the shorts brown or purple?"}, {"query": "Who wears shoes?"}, {"query": "Who wears the shoes?"}, {"query": "Who wears the shirt?"}, {"query": "How large are the shoes?"}, {"query": "What is the soft glove made of, rubber or leather?"}, {"query": "How old is the small person?"}, {"query": "Is the rubber glove blue and soft?"}, {"query": "The professional person is wearing what?"}, {"query": "What is the young person playing with?"}, {"query": "Who is sitting next to the adult person?"}, {"query": "Is the shirt made of cloth both soft and gray?"}, {"query": "Does the glove have black color?"}, {"query": "What is the child sitting on?"}, {"query": "Who is sitting on the seat?"}, {"query": "What do you think is the child sitting on?"}, {"query": "Does the young person touch the toothbrush?"}, {"query": "Is the professional person holding a phone?"}, {"query": "Are there children or women?"}, {"query": "Who is touching the glove?"}, {"query": "Is the toy in the top part or in the bottom?"}, {"query": "Who wears a shirt?"}, {"query": "Is the toy red and small?"}, {"query": "What do you think the toy that looks blue is made of?"}]}
{"imageid": "n540282", "question": [{"query": "Is the woman to the right of the person that is wearing a suit?"}, {"query": "Is the kiosk that is not small red and open?"}, {"query": "What type of clothing is not sleeveless, the dress or the suit?"}, {"query": "What type of clothing is not sleeveless?"}, {"query": "Which kind of clothing is not sleeveless?"}, {"query": "Is the dress both sleeveless and orange?"}, {"query": "Is the suit long sleeved and black?"}, {"query": "Which place is it?"}, {"query": "What is the image showing?"}, {"query": "Is the young person to the left or to the right of the person that is wearing a tie?"}, {"query": "How large is the kiosk the woman is standing in?"}, {"query": "Is the person that is not old wearing a dress?"}, {"query": "What is the long sleeved piece of clothing?"}, {"query": "Which kind of device is the woman holding?"}, {"query": "What is the device that the woman is holding?"}, {"query": "What's the woman holding?"}, {"query": "What article of clothing isn't patterned?"}, {"query": "What item of clothing is not long sleeved?"}, {"query": "What kind of clothing is long sleeved?"}, {"query": "What piece of clothing is long sleeved, the suit or the dress?"}, {"query": "Is the color of the suit different than that of the necktie?"}, {"query": "What color is the sleeveless dress, black or purple?"}, {"query": "Is the man to the left or to the right of the woman that is wearing a dress?"}, {"query": "Does the necktie that is not large look black?"}, {"query": "Is the woman young and brunette?"}, {"query": "Who is holding the phone?"}, {"query": "Who does the shaved man look at?"}, {"query": "Who does the man look at?"}, {"query": "Is the shaved man wearing a suit?"}, {"query": "Is the man on the right?"}, {"query": "Is the young person looking at a laptop?"}, {"query": "Who is standing in the kiosk?"}, {"query": "Where is the woman standing?"}, {"query": "Who is wearing the bracelet?"}, {"query": "Is the tie small?"}, {"query": "Does the tie look small and black?"}]}
{"imageid": "n306745", "question": [{"query": "What is the white article of clothing in the photograph?"}, {"query": "What kind of clothing is white?"}, {"query": "Who is holding onto the beautiful bouquet?"}, {"query": "What is the Caucasian woman holding onto?"}, {"query": "Is the standing woman to the right of the bag holding onto the flower bouquet?"}, {"query": "Which race is the man that is wearing trousers?"}, {"query": "Which color are the pants the man is wearing?"}, {"query": "What is the color of the platter?"}, {"query": "Is the man to the right or to the left of the bag?"}, {"query": "Which kind of clothing is pretty?"}, {"query": "Which kind of clothing is plain?"}, {"query": "What kind of clothing is formal?"}, {"query": "Are both the pavement and the stop sign made of the same material?"}, {"query": "Do the camera and the stop sign have the same color?"}, {"query": "Are the platter and the pole the same color?"}, {"query": "Is the flower bouquet to the right of the man purple or white?"}, {"query": "Does the camera have black color?"}, {"query": "Is that platter both blue and huge?"}, {"query": "Does the standing woman to the right of the bag look Caucasian?"}, {"query": "Are the vehicles made of metal?"}, {"query": "What size are the vehicles, small or large?"}, {"query": "Who is in front of the man?"}, {"query": "Who is wearing trousers?"}, {"query": "Is the bouquet on the right?"}, {"query": "Are there any cameras or laptops that are not white?"}, {"query": "Is the camera to the right of the woman white and small?"}, {"query": "Is the camera large or small?"}, {"query": "What size is the flower bouquet that looks green and purple?"}, {"query": "Does the black shirt look long sleeved?"}, {"query": "Who is in front of the street sign that looks red and white?"}, {"query": "Is the fat woman in front of the street sign that is white?"}, {"query": "What does the person that to the left of the woman hold?"}, {"query": "Does the person to the left of the woman hold the platter that is standing?"}, {"query": "Are there people to the left of the fat woman?"}, {"query": "Is the flower bouquet to the right of the man both beautiful and large?"}, {"query": "The man is in front of what?"}, {"query": "What is the woman in front of the man wearing?"}, {"query": "Who is looking down at the camera?"}, {"query": "Is the Caucasian woman looking down at a cell phone?"}, {"query": "What is the color of the shirt the person is wearing?"}, {"query": "What is the device that is to the right of the person that is behind the woman?"}, {"query": "How long are the trousers the woman is wearing?"}, {"query": "How long are the pants the man wears?"}, {"query": "What is the size of that platter?"}, {"query": "Does the woman in front of the street sign look skinny?"}, {"query": "Are the vehicles small and metallic?"}, {"query": "What is the person to the left of the woman wearing?"}, {"query": "Which color are the pants the woman is wearing?"}, {"query": "What is the color of the shirt the woman is wearing?"}]}
{"imageid": "n554911", "question": [{"query": "Is the TV stand both wooden and white?"}, {"query": "On which side of the picture is the shelf?"}, {"query": "What piece of furniture is not blue?"}, {"query": "What kind of furniture is on the rug?"}, {"query": "What is the item of furniture on the brown rug?"}, {"query": "What was used to make the ottoman?"}, {"query": "What kind of furniture is on the rug?"}, {"query": "What type of furniture is on the brown rug?"}, {"query": "What is the ottoman on?"}, {"query": "Are there any helmets or envelopes?"}, {"query": "Of which color is the rug to the right of the couch?"}, {"query": "Are there dogs on the rug?"}, {"query": "Is the couch to the left of the shelf made of leather?"}, {"query": "Is the soft couch on the rug blue or white?"}, {"query": "Is the blue couch to the right or to the left of the chairs that are presented in the photo?"}, {"query": "What color does the device on top of the TV stand have?"}, {"query": "Is the black television to the left or to the right of the picture the door is next to?"}, {"query": "Is the side table rectangular and black?"}, {"query": "Does the side table look black?"}, {"query": "What's the side table on?"}, {"query": "How is the piece of furniture on the rug called?"}, {"query": "What item of furniture is on the rug?"}, {"query": "The side table made of wood is which shape?"}, {"query": "Which kind of furniture is to the left of the TV stand?"}, {"query": "Are there both windows and doors in this scene?"}, {"query": "Do the side table made of wood and the ottoman both look beige?"}, {"query": "What are the pieces of furniture to the left of the couch the side table is next to called?"}, {"query": "Is the fan next to the window white and wooden?"}, {"query": "Is the couch made of cloth brown and soft?"}, {"query": "Are there chairs near the door?"}, {"query": "What is the television made of?"}, {"query": "On which side is the rectangular picture?"}, {"query": "Which kind of furniture is to the right of the ottoman?"}, {"query": "What is the piece of furniture to the right of the ottoman?"}, {"query": "What item of furniture is to the left of the shelf?"}, {"query": "Are there any TV stands next to the rectangular door?"}, {"query": "What shape is the picture?"}, {"query": "What kind of furniture has the same color as the light fixture that is not short?"}, {"query": "What is common to the shelf and the light fixture?"}, {"query": "Are the TV stand and the side table made of the same material?"}, {"query": "Is the door near the chairs round and gray?"}, {"query": "What piece of furniture is blue?"}, {"query": "Which kind of furniture is to the right of the table?"}, {"query": "Is the glass window near the fan clear or cloudy?"}, {"query": "Which color is the ottoman the couch is to the left of?"}, {"query": "Is there either a round mirror or ottoman?"}]}
{"imageid": "n273221", "question": [{"query": "Who is standing?"}, {"query": "Where in the picture is the racket, on the left or on the right?"}, {"query": "Who is the camera watching?"}, {"query": "What color are the shoes?"}, {"query": "Who is this player in front of?"}, {"query": "Which kind of device is watching the player?"}, {"query": "What do both the tennis ball and the racket have in common?"}, {"query": "Does the racket look light?"}, {"query": "Is there a racket or a ball in the photo?"}, {"query": "Is the tennis ball that looks round small and green?"}, {"query": "Who is the large device that is to the right of the man watching?"}, {"query": "The person that is playing is holding what?"}, {"query": "Who is the player in front of?"}, {"query": "Who is wearing shorts?"}, {"query": "Who is wearing the shorts?"}, {"query": "What is the person that is playing hitting?"}, {"query": "What is the player hitting?"}, {"query": "Who is hitting the tennis ball?"}, {"query": "How is the device to the right of the unhappy man called?"}, {"query": "Is the large camera to the right of a player?"}, {"query": "Is the large camera to the right or to the left of the person that is holding the racket?"}, {"query": "Does the calm man seem to be happy?"}, {"query": "Is the tennis ball white?"}, {"query": "Is the man behind the player playing or staring?"}, {"query": "Who is in front of the man on the right part of the image?"}, {"query": "What is the player wearing?"}, {"query": "The person that is playing is wearing what?"}, {"query": "What is the man that is to the left of the other man doing?"}, {"query": "Who is the unhappy man watching?"}, {"query": "Is the tennis ball on the right side?"}, {"query": "What are the glasses made of?"}, {"query": "Is the camera small?"}, {"query": "Is the tennis racket both light and round?"}, {"query": "Is the camera to the left or to the right of the man in the center?"}, {"query": "What kind of device is to the left of the man in the middle of the photo?"}, {"query": "Is the player on the left?"}, {"query": "Are the glasses on the right side?"}]}
{"imageid": "n507592", "question": [{"query": "Who is wearing a jacket?"}, {"query": "Is the sky clear or stormy?"}, {"query": "Are there any skis or snowboards that are not long?"}, {"query": "What height do you think the man to the left of the skis is?"}, {"query": "Which color is that jacket?"}, {"query": "Is that sky both white and high?"}, {"query": "Does the man near the other man look still?"}, {"query": "Do the pants look long and black?"}, {"query": "Does the man near the other man seem to be tall and still?"}, {"query": "What height is the man near the other man?"}, {"query": "What is the man near the other man doing, staring or eating?"}, {"query": "Are there snowboards above the white snow?"}, {"query": "Are there skis or skiers?"}, {"query": "Is that snow under a snowboard?"}, {"query": "Does the man next to the other man appear to be driving?"}]}
{"imageid": "n271826", "question": [{"query": "How clean are the trousers?"}, {"query": "Does the white hat look hard and clean?"}, {"query": "Is the fence in front or behind the person that is guiding the horse?"}, {"query": "Does the person in front of the fence seem to be waiting?"}, {"query": "Is the shirt made of jeans white or blue?"}, {"query": "Is this a wooden fence?"}, {"query": "Does the fence seem to be short and closed?"}, {"query": "Do you see black gloves or hats?"}, {"query": "What color is the hat?"}, {"query": "Does the denim shirt look long sleeved or short sleeved?"}, {"query": "How big is the horse the person is to the right of?"}, {"query": "Does the horse that is not ugly look white and clean?"}, {"query": "Is the short sleeved shirt dirty and red?"}, {"query": "Is the denim shirt blue and long sleeved?"}, {"query": "Do the trousers look long and blue?"}, {"query": "Do these animals have different types?"}, {"query": "What is the person to the right of the other person doing?"}, {"query": "What kind of animal is large?"}, {"query": "Which kind of animal in the image is large?"}, {"query": "Does the clean shirt have green color?"}, {"query": "Is the grassy ground wet or dry?"}, {"query": "Is the fence large or small?"}, {"query": "How clean is the horse that is not small?"}, {"query": "Does the running horse to the left of the person look brown and large?"}, {"query": "Do both these people have the same gender?"}, {"query": "What animal do you think is the person that is not male guiding?"}, {"query": "Is the person in front of the fence wearing a hat?"}, {"query": "Is the male person sitting atop a fence?"}, {"query": "What is the person that is not female sitting atop?"}, {"query": "Is the hat dirty or clean?"}, {"query": "How hard is the hat the person is wearing?"}, {"query": "Is the female person behind a fence?"}, {"query": "Does the large horse appear to be standing?"}, {"query": "Is the large horse eating or looking up?"}, {"query": "Does the ground look grassy or snowy?"}, {"query": "Does the male person appear to be sitting?"}]}
{"imageid": "n426450", "question": [{"query": "What is located on top of the stove the person is behind of?"}, {"query": "Is the flower pot small and orange?"}, {"query": "Does the door behind the person look wooden and white?"}, {"query": "What color is the shirt?"}, {"query": "Does the plant pot have the same color as the door?"}, {"query": "Is the happy person behind the appliance in the bottom?"}, {"query": "In which part of the photo is the large appliance, the bottom or the top?"}, {"query": "Does the box look little?"}, {"query": "What cooking utensil is the same color as the stove top that is made of metal?"}, {"query": "Is the white door behind her?"}, {"query": "What piece of furniture is rustic?"}, {"query": "What type of furniture is to the right of the big appliance that is in front of the person?"}, {"query": "Is the container to the left of the stove white and large?"}, {"query": "Which side of the picture is the small vase on?"}, {"query": "Are the table and the burner made of the same material?"}, {"query": "Is the color of the pants blue?"}, {"query": "What appliance is rustic?"}, {"query": "Does the vase look black?"}, {"query": "Is that vase on top of a cabinet?"}, {"query": "Do the cake and the door have the same color?"}, {"query": "What color is the flower pot that is on top of the table?"}, {"query": "What is the plant pot in front of?"}, {"query": "What is in front of the vase?"}, {"query": "How big is the dessert she is cutting?"}, {"query": "What piece of furniture is made of the same material as the door?"}, {"query": "What do you think is the cooking utensil that is on top of the table?"}, {"query": "What cooking utensil is on top of the table?"}, {"query": "How large is the stove?"}, {"query": "What appliance is the person behind of?"}, {"query": "What appliance is she behind of?"}, {"query": "What appliance is in this image?"}, {"query": "Is there a cake in the image that is white?"}, {"query": "Are both the stove top and the knife made of the same material?"}, {"query": "Is the black skillet on the right or on the left side of the photo?"}, {"query": "What dessert is the person looking down at?"}, {"query": "What does the person hold?"}, {"query": "Is the small flower pot in front of the vase?"}, {"query": "What is the skillet made of?"}, {"query": "Are the flowers inside the plant pot yellow and small?"}, {"query": "Which kind of appliance is before the person?"}, {"query": "What is in front of her?"}, {"query": "What is in front of the person?"}, {"query": "What is inside the flower pot?"}, {"query": "What are the flowers inside of?"}, {"query": "Are there any drawers to the left of the appliance that is to the left of the table?"}, {"query": "Is she looking down at a cake?"}, {"query": "What cooking utensil is to the left of the vase?"}, {"query": "What is the person in front of?"}, {"query": "Is the skillet to the left of a spoon?"}, {"query": "What is this person doing?"}, {"query": "Does the female person in front of the door look blond or brunette?"}, {"query": "What is the person doing?"}, {"query": "What is she in front of?"}, {"query": "Is that a brown box?"}, {"query": "Is the shirt long sleeved or short sleeved?"}, {"query": "Do you see mattresses or cigarettes?"}, {"query": "Is the vase small or large?"}, {"query": "Is the vase to the left of her light blue and small?"}, {"query": "Does the knife look large and metallic?"}, {"query": "Is the baked dessert large and black?"}, {"query": "Does she wear jeans?"}, {"query": "What type of appliance is in front of her?"}]}
{"imageid": "n360546", "question": [{"query": "Which kind of furniture is gray?"}, {"query": "Of which color is the fork?"}, {"query": "Is the smoothie on the left?"}, {"query": "What type of fast food is to the left of the spoon the fork is beside of?"}, {"query": "What kind of furniture is large?"}, {"query": "What is the large item of furniture called?"}, {"query": "Is the shape of the smoothie the same as the pizza?"}, {"query": "What size is that table?"}, {"query": "Does the knife above the tray have silver color?"}, {"query": "On which side of the image is the spoon, the right or the left?"}, {"query": "What is that, a hot dog or a pizza?"}, {"query": "What kind of furniture is underneath the tray?"}, {"query": "Is that knife to the right of a plate?"}, {"query": "How big is this tray?"}, {"query": "Is the tray underneath the pizza hard and large?"}, {"query": "Does that tray have teal color?"}, {"query": "What's the tray made of?"}, {"query": "Is this table small and gray?"}, {"query": "What is the food that is on top of the tray?"}, {"query": "Does the pizza above the tray look cooked?"}, {"query": "Is the round pizza to the left or to the right of the fork?"}, {"query": "Is there any fork or bottle in the scene?"}, {"query": "What kind of drink is on top of the tray?"}, {"query": "What food is tasty?"}, {"query": "Are there either red ottomen or tables?"}, {"query": "Which kind of fast food is on top of the tray?"}, {"query": "Is there a knife that is not made of metal?"}, {"query": "Is that spoon to the right of a bottle?"}, {"query": "Are there any spoons to the right of the cheese that is cooked in the pizza?"}, {"query": "Is this milk or cheese?"}, {"query": "What is underneath the knife?"}, {"query": "Where in the image is the black knife, on the right or on the left?"}, {"query": "Is the delicious pizza above the tray?"}, {"query": "Is there either a cup or a knife in this photo?"}, {"query": "Is this tray underneath a donut?"}, {"query": "What is underneath the food that the cheese is cooked in?"}, {"query": "Is the plastic tray underneath a knife?"}, {"query": "What is underneath the pizza?"}]}
{"imageid": "n20448", "question": [{"query": "Who wears a wristwatch?"}, {"query": "Who is wearing the necklace?"}, {"query": "What color is the bag that the woman is carrying?"}, {"query": "What is the table made of?"}, {"query": "Which kind of material is the large table made of?"}, {"query": "What kind of drink is the woman carrying?"}, {"query": "What is the device that she is holding?"}, {"query": "What is the woman holding?"}, {"query": "Is the hand soap in the top or in the bottom part?"}, {"query": "Is she wearing a necklace?"}, {"query": "Are there small tables or nightstands?"}, {"query": "Does this woman look old?"}, {"query": "Who is carrying the wine?"}, {"query": "Is the old person holding a baby?"}, {"query": "What is the old person doing?"}, {"query": "Is the bag open or closed?"}, {"query": "What color is the telephone?"}, {"query": "Is the old person carrying a bag?"}, {"query": "Which kind of furniture is made of metal?"}, {"query": "Does the table look large and metallic?"}, {"query": "Which kind of furniture is metallic?"}, {"query": "What material is the wristwatch that is small?"}, {"query": "What is the wristwatch made of?"}, {"query": "What kind of furniture is it?"}, {"query": "Is the bag to the left or to the right of the talking woman who is to the left of the hand soap?"}, {"query": "What do the phone and the basket have in common?"}, {"query": "Do you see either any bags or phones that are white?"}, {"query": "How large is the table that is made of metal?"}, {"query": "Is the table made of the same material as the pole?"}, {"query": "What makes up the basket?"}, {"query": "What is the walking woman to the right of the bag doing?"}, {"query": "Are there either men or women that are not old?"}, {"query": "The basket is on what?"}, {"query": "What is the basket on?"}]}
{"imageid": "n148943", "question": [{"query": "Which kind of clothing is white?"}, {"query": "Are there purses on top of the wood bench?"}, {"query": "On which side is the full cup?"}, {"query": "Who is looking down?"}, {"query": "Is there an umbrella or a bench in the photo?"}, {"query": "Is the woman to the left or to the right of the cup near the purse?"}, {"query": "Is the cup near the purse empty or full?"}, {"query": "Do you think the woman is looking down?"}, {"query": "Is the leather purse on the right of the photo?"}, {"query": "Is there a bench in this photo that is empty?"}, {"query": "What is the person to the left of the cup sitting on?"}, {"query": "Who is wearing the skirt?"}, {"query": "What is the color of the shoe?"}, {"query": "Who is sitting on the bench?"}, {"query": "What is she in front of?"}, {"query": "What's the woman in front of?"}, {"query": "Who is in front of the door made of wood?"}, {"query": "Is this a full bench?"}, {"query": "Who is wearing the shoe?"}, {"query": "What is the white piece of clothing?"}, {"query": "What do the skirt and the door have in common?"}, {"query": "Is the bench made of the same material as the shoe?"}]}
{"imageid": "n291848", "question": [{"query": "What is the bag sitting on?"}, {"query": "What is the white object near the luggage sitting on?"}, {"query": "Is the walkway made of the same material as the pole?"}, {"query": "Which side of the image is the white bag on?"}, {"query": "What is in front of the black suitcases?"}, {"query": "Are there either chairs or desks in the image?"}, {"query": "Which place is it?"}, {"query": "What do the pole and the sign have in common?"}, {"query": "What is in front of the pole?"}, {"query": "What are the suitcases in front of?"}, {"query": "What is the bag in front of?"}, {"query": "What are the suitcases sitting on?"}, {"query": "On which side is the water bottle?"}, {"query": "What's in front of the pole?"}, {"query": "Does the luggage have purple color?"}, {"query": "What is the weight of the suitcases?"}, {"query": "Are the suitcases near the luggage full and black?"}, {"query": "What place could this be?"}, {"query": "Is the luggage near the bag empty or full?"}, {"query": "What is the luggage near the bag sitting on?"}, {"query": "Is the painting on the right side?"}, {"query": "What is the water bottle in front of?"}, {"query": "What's in front of the suitcases?"}, {"query": "Is the painting behind a bag?"}, {"query": "What is the pattern of the bag?"}, {"query": "Is the white bag both dotted and empty?"}, {"query": "What's the pattern of the bag?"}]}
{"imageid": "n575292", "question": [{"query": "Who is the forest standing behind of?"}, {"query": "Does the tennis ball have white color and round shape?"}, {"query": "What is the tennis ball pushed by?"}, {"query": "Is the tennis ball that looks round pushed by the bat?"}, {"query": "What is pushed by the bat?"}, {"query": "On which side of the image is the tennis ball, the right or the left?"}, {"query": "The bat is pushing what?"}, {"query": "Does the boy look happy?"}, {"query": "What is the boy playing with?"}, {"query": "The boy is playing with what?"}, {"query": "Is the shirt made of cloth modern and short sleeved?"}, {"query": "Is there a fence in the picture?"}, {"query": "Are both the bat and the tree made of the same material?"}, {"query": "Is it indoors or outdoors?"}, {"query": "How old is he?"}, {"query": "Does the shirt look antique?"}, {"query": "What color is the tennis ball in the top part of the picture?"}, {"query": "Are there tennis players or bats?"}, {"query": "What is pushing the tennis ball?"}, {"query": "Do the boots seem to be Adidas?"}, {"query": "Are there any Nike boots?"}, {"query": "What color is the boy that is not old?"}, {"query": "Is the young boy on the left side or on the right of the picture?"}, {"query": "The boots are worn on who?"}, {"query": "What is worn on the boy?"}, {"query": "What is worn on the happy person that is playing with a bat?"}, {"query": "What is used to make the tennis bat?"}, {"query": "Where is the tree standing?"}, {"query": "Are there either rackets or tennis balls?"}, {"query": "Who is playing?"}, {"query": "What is standing behind the young person?"}]}
{"imageid": "n76241", "question": [{"query": "What do the stop sign and the street sign have in common?"}, {"query": "What sign is made of the same material as the street sign?"}, {"query": "What's the man doing?"}, {"query": "Is he both adult and young?"}, {"query": "Do the trousers have dark color and short length?"}, {"query": "What type of device are the trees behind of?"}, {"query": "Which kind of device are the trees behind of?"}, {"query": "What kind of sign has the same shape as the hat?"}, {"query": "What do the stop sign and the hat have in common?"}, {"query": "What kind of sign is in front of the evergreen trees?"}, {"query": "Which kind of sign is in front of the trees?"}, {"query": "What sign are the trees behind of?"}, {"query": "Who is wearing the jacket?"}, {"query": "Do the trees look wooden and green?"}, {"query": "What is the old man doing?"}, {"query": "Is the hat made of plastic?"}, {"query": "What is the hat made of?"}, {"query": "What do both the street sign and the jacket have in common?"}, {"query": "What sign has the same color as the jacket?"}, {"query": "Who is standing on top of the road?"}, {"query": "What is he holding onto?"}, {"query": "What is the man holding onto?"}, {"query": "What do you think is he standing on top of?"}, {"query": "Is the road both white and striped?"}, {"query": "What is the radio before?"}, {"query": "What device is in front of the trees?"}, {"query": "What is the radio in front of?"}, {"query": "What is the device in front of the trees made of wood?"}, {"query": "Of what color is the device in front of the trees?"}, {"query": "How is the device that is the same color as the road that is shown in this picture called?"}, {"query": "Which color do you think the jacket is?"}, {"query": "Is the road different in color than the radio?"}, {"query": "Who is standing?"}, {"query": "Does the old person appear to be crouching?"}, {"query": "Is there a camera in this scene?"}, {"query": "Is the jacket striped and short sleeved?"}, {"query": "On which side of the picture is the black radio?"}, {"query": "Do the radio and the jacket have a different colors?"}, {"query": "Is the radio in front of the trees both white and small?"}, {"query": "Is the jacket striped or maybe checkered?"}, {"query": "The hat has what color?"}]}
{"imageid": "n183252", "question": [{"query": "What device isn't white?"}, {"query": "What device is white?"}, {"query": "Do the telephone and the soda can have the same color?"}, {"query": "How large is the telephone?"}, {"query": "Which kind of clothing is worn?"}, {"query": "Is the white thing near the shirt large and rectangular?"}, {"query": "What kind of device is corded?"}, {"query": "Which kind of device is not corded?"}, {"query": "What piece of furniture is modern?"}, {"query": "Which side is the black device on?"}, {"query": "What device is rectangular?"}, {"query": "What device is not on?"}, {"query": "What kind of device is rectangular, the telephone or the Wii remotes?"}, {"query": "Does the plant have a different color than the wall?"}, {"query": "Is the table different in color than the soda can?"}, {"query": "Does the telephone on the table have black color and large size?"}, {"query": "What kind of device is on?"}, {"query": "Which kind of furniture is in front of the wall?"}, {"query": "Is the soft couch behind her?"}, {"query": "Is this a young person?"}, {"query": "What shape is this Wii controller?"}, {"query": "Is the table to the left of the couch?"}, {"query": "What is the person doing?"}, {"query": "Are the sneakers on the floor new or old?"}, {"query": "Is she in front of the couch that the table is to the right of?"}, {"query": "Which color is the couch?"}, {"query": "Do both the device that looks black and the device near the shirt have small size?"}, {"query": "Does the couch behind her look clean and blue?"}, {"query": "What kind of furniture is on the floor?"}, {"query": "Is the table made of the same material as the floor?"}, {"query": "Is the plant different in color than the Wii remotes?"}, {"query": "What is the person holding?"}, {"query": "What is she holding?"}, {"query": "What device is the person holding?"}, {"query": "What do you think is the device that she is holding?"}, {"query": "Is the pillow on the right?"}, {"query": "Is she holding the Wii controller that looks white?"}, {"query": "Do you see a Wii controller near the shirt?"}, {"query": "Do the sneakers on the floor seem to be new and white?"}, {"query": "What is the name of the articles of clothing that are blue?"}, {"query": "What is the piece of furniture that the wall is behind of called?"}, {"query": "Is that a happy person?"}, {"query": "What is the large floor made of?"}, {"query": "What is the device to the right of her?"}, {"query": "Is this a headphone or a Wii controller?"}, {"query": "Is there any couch above the soda can?"}, {"query": "Where are the sneakers?"}, {"query": "How clean are the white sneakers?"}, {"query": "Which kind of furniture is the person in front of?"}, {"query": "What is the name of the piece of furniture that she is in front of?"}, {"query": "What is the person in front of?"}, {"query": "The person is in front of what?"}, {"query": "Is the soda can underneath the couch white and large?"}, {"query": "Is the soda can underneath a bed?"}, {"query": "What is underneath the couch?"}, {"query": "What is the table made of?"}, {"query": "Does the pillow on the couch seem to be round or rectangular?"}, {"query": "What color is the pillow on the left?"}, {"query": "What device is on the table?"}, {"query": "Does the shirt near the Wii controller look white and short sleeved?"}, {"query": "Is the shirt long sleeved?"}, {"query": "What is the piece of furniture that the pillow is on?"}, {"query": "What do you think is on the couch behind the person?"}, {"query": "Is she wearing shorts?"}, {"query": "What type of furniture is above the soda can?"}, {"query": "Which kind of furniture is above the soda can?"}, {"query": "What is the plant in front of?"}, {"query": "Is the pillow on the couch both rectangular and beige?"}]}
{"imageid": "n110941", "question": [{"query": "Is there any table that is brown?"}, {"query": "Is the vase white and small?"}, {"query": "How big is the white thing that is holding the flower?"}, {"query": "What do both the ceiling light and the window have in common?"}, {"query": "Which room is it?"}, {"query": "Do the vase and the floor have a different colors?"}, {"query": "Is the ceiling light made of the same material as the shelf?"}, {"query": "Is the ceiling light above the table?"}, {"query": "Is that door open or closed?"}, {"query": "Which kind of furniture is not simple?"}, {"query": "Which type of furniture is brown, the table or the shelf?"}, {"query": "Does the door appear to be white and closed?"}, {"query": "Could this room be the bathroom or the dining room?"}, {"query": "Where in the picture is the shelf, in the top or in the bottom?"}, {"query": "What is on the floor?"}, {"query": "What type of furniture is on the floor?"}, {"query": "Where is the table?"}, {"query": "Is that flower small and colorful?"}, {"query": "What is the size of the flower?"}, {"query": "Are there any shelves near the ceiling light above the table?"}, {"query": "Is it an outdoors scene?"}, {"query": "What holds the flower?"}, {"query": "Is this table brown or white?"}, {"query": "Is the brown table below the ceiling light made of glass?"}, {"query": "Which kind of furniture is below the ceiling light?"}, {"query": "Is the window open or closed?"}, {"query": "Which color is the vase that is not big?"}, {"query": "Are there both windows and doors in this image?"}]}
{"imageid": "n441823", "question": [{"query": "Do the passengers to the left of the other passengers look female?"}, {"query": "Are the passengers that are not male and the passengers that look unhappy both waiting?"}, {"query": "Is the motorcycle small?"}, {"query": "Is the unhappy man to the left of a motorcycle?"}, {"query": "Who stands next to the motorcycle?"}, {"query": "On which side of the picture is the unhappy man?"}, {"query": "Which side of the picture is the brick building on?"}, {"query": "Does the road look clean?"}, {"query": "Is the color of the helmet different than the motorcycle?"}, {"query": "Is that motorbike new or old?"}, {"query": "Is the black motorcycle to the right or to the left of the unhappy man?"}, {"query": "On which side of the image is the man?"}, {"query": "Is the unhappy man to the left of the helmet the passengers are to the left of?"}, {"query": "Which kind of vehicle is it?"}, {"query": "Is the city beautiful?"}, {"query": "What is the driver wearing?"}, {"query": "Who is wearing a helmet?"}, {"query": "Who is wearing the helmet?"}, {"query": "Is the person that is sitting wearing a helmet?"}, {"query": "Does the vehicle that is not empty look ugly or beautiful?"}, {"query": "What vehicle is on the road?"}, {"query": "What is the vehicle on the dirty road called?"}, {"query": "Are there any men to the left of the driver?"}, {"query": "Is the helmet that is to the right of the passengers both blue and round?"}, {"query": "Is the unhappy man to the right of the passengers that the van is waiting for?"}, {"query": "What vehicle is busy?"}, {"query": "What vehicle is full?"}, {"query": "Who is sitting?"}, {"query": "How does the city look, full or empty?"}, {"query": "Does the vehicle that is not beautiful look full?"}, {"query": "What color does the brick building have?"}, {"query": "What is the name of this vehicle?"}, {"query": "What color is the motorbike?"}, {"query": "Who is waiting?"}, {"query": "Who is the van waiting for?"}, {"query": "What is waiting for the passengers the man is to the right of?"}, {"query": "What vehicle is waiting for the passengers that look unhappy?"}, {"query": "What vehicle is ugly?"}, {"query": "What is the vehicle that the unhappy man is waiting for?"}, {"query": "Which place is it?"}, {"query": "Is the motorcycle that is to the left of the man small and old?"}, {"query": "Who is sitting on the old motorcycle that is on the road?"}, {"query": "Who is sitting on the motorcycle?"}, {"query": "What do you think is the person that is sitting-down sitting on?"}, {"query": "Who is waiting for the vehicle that is not empty?"}, {"query": "What is the unhappy man waiting for?"}, {"query": "What vehicle is packed?"}]}
{"imageid": "n67124", "question": [{"query": "Is the chair blue and high?"}, {"query": "Are there either red hats or scarves?"}, {"query": "What is the catcher larger than?"}, {"query": "Who is larger than the home plate?"}, {"query": "Are there any pictures or helmets in the picture?"}, {"query": "What is before the catcher?"}, {"query": "What is the gender of the person that sits near the fence?"}, {"query": "Which is smaller, the catcher or the home plate?"}, {"query": "Which is longer, the home plate or the fence?"}, {"query": "Is the fence longer than the home plate?"}, {"query": "Are the chair and the home plate the same color?"}, {"query": "Is the helmet the same color as the wrist band?"}, {"query": "Do you think that helmet is red?"}, {"query": "Does the fence look black and metallic?"}, {"query": "What is the male person sitting by?"}, {"query": "What is longer than the home plate?"}, {"query": "The fence post is smaller than who?"}, {"query": "What is smaller than the catcher?"}, {"query": "What is common to the fence post and the fence?"}, {"query": "Is the male person sitting near the fence?"}, {"query": "Who is playing?"}, {"query": "What is in front of the person who is wearing a helmet?"}, {"query": "Where is the catcher?"}, {"query": "Who is on the brown dirt?"}, {"query": "Who is on the dirt?"}, {"query": "Is the chair made of plastic?"}, {"query": "What color is the baseball hat?"}, {"query": "What type of furniture is made of the same material as the helmet the catcher is wearing?"}, {"query": "Which is larger, the catcher or the fence post?"}, {"query": "What is the color of the wristband that the catcher is wearing?"}, {"query": "Is the chair made of the same material as the fence?"}, {"query": "Who is wearing the wristband?"}, {"query": "Who is wearing a wristband?"}, {"query": "Is this catcher wearing a glove?"}, {"query": "Who is wearing the helmet?"}, {"query": "Is the high chair to the left or to the right of the helmet made of plastic?"}, {"query": "What is the metal fence longer than?"}]}
{"imageid": "n180320", "question": [{"query": "Is the lid on top of the jar both round and black?"}, {"query": "Does the jar to the right of the other jar appear to be standing?"}, {"query": "What is located on top of the countertop?"}, {"query": "What kind of appliance is on top of the countertop?"}, {"query": "What type of appliance is on top of the countertop below the cabinets?"}, {"query": "Are these cabinets above a microwave?"}, {"query": "What material is the lid, rubber or wood?"}, {"query": "Does the jar near the wok appear to be blue?"}, {"query": "What color is the wok near the jar?"}, {"query": "What appliance is standing?"}, {"query": "What is common to the wok and the lid?"}, {"query": "What cooking utensil has the same color as the lid on top of the jar?"}, {"query": "What is the appliance to the left of the wok near the jar?"}, {"query": "Which side of the image is the wok on?"}, {"query": "What kind of cooking utensil has the same shape as the lid?"}, {"query": "What do the wok and the lid have in common?"}, {"query": "Do you see any food in the photograph?"}, {"query": "What pieces of furniture are white?"}, {"query": "Which kind of furniture is it?"}, {"query": "What are this items of furniture called?"}, {"query": "Which kind of furniture is strong?"}, {"query": "Is the blender standing?"}, {"query": "What items of furniture are white?"}, {"query": "Is the lid on top of a toilet?"}, {"query": "What is located on top of the jar in the middle?"}, {"query": "Which kind of appliance is heavy?"}, {"query": "What kind of appliance is heavy?"}, {"query": "What is the weight of the blender?"}]}
{"imageid": "n206133", "question": [{"query": "Do the books look thick and red?"}, {"query": "On which side of the image are the books?"}, {"query": "What are the pieces of furniture above the ground?"}, {"query": "What color is the ground?"}, {"query": "Are there any doors?"}, {"query": "Is the open room large or small?"}, {"query": "Which kind of furniture is black?"}, {"query": "Do the white papers look square?"}, {"query": "Is there a chair above the clean ground?"}, {"query": "What kind of furniture is it?"}, {"query": "Are the papers on the right side?"}, {"query": "Are there any televisions near the chairs?"}, {"query": "Do the books look thin or thick?"}, {"query": "How clean is the ground the chairs are above?"}, {"query": "Does that ground look gray and clean?"}, {"query": "Which kind of furniture is empty?"}, {"query": "What is the name of the empty items of furniture?"}, {"query": "What is the name of this pieces of furniture?"}, {"query": "Is it outdoors?"}, {"query": "Do the chairs and the papers have the same color?"}, {"query": "Which kind of furniture is above the ground?"}]}
{"imageid": "n181615", "question": [{"query": "Is the fence to the right of the tower made of wood or metal?"}, {"query": "Who is talking?"}, {"query": "Who is leaning on the fence to the right of the tower?"}, {"query": "What are the people to the left of the bird leaning on?"}, {"query": "Are the people that are talking leaning on the wood fence?"}, {"query": "What are the people that are talking standing on top of?"}, {"query": "How large is the building that is on top of the dock?"}, {"query": "Is the gray bird to the left of the people that are standing on top of the dock?"}, {"query": "Is the pier wide and thick?"}, {"query": "What is the bird standing on?"}, {"query": "Who is holding onto the surfboard that is not large?"}, {"query": "Does the surfer look young?"}, {"query": "Does the surfboard that looks black and white look large?"}, {"query": "What do both the surfboard and the lamp post have in common?"}, {"query": "Does the pier look narrow?"}, {"query": "How thick is the pier?"}, {"query": "What is the tower made of, wood or stone?"}, {"query": "Is the surfboard that is not large both white and light?"}, {"query": "On which side of the photo is the surfboard?"}, {"query": "Do you see a surfboard that is not light?"}, {"query": "The bird that is gray and white is standing on what?"}, {"query": "Who in the photo is standing?"}, {"query": "Is there either a hydrant or a fence in the picture?"}, {"query": "Are there any towers on top of the pier?"}, {"query": "What is the gender of the surfer on the left?"}, {"query": "What is the young person doing, standing or bending?"}, {"query": "What do the fence and the tower have in common?"}, {"query": "On which side is the gray bird?"}, {"query": "Who is standing?"}, {"query": "Is the building on top of the pier tall and metallic?"}, {"query": "Are there any benches or fences that are made of wood?"}]}
{"imageid": "n128232", "question": [{"query": "Is the empty bowl to the left or to the right of the woman that is wearing pants?"}, {"query": "Does the woman that is looking down seem to be sitting?"}, {"query": "Is the shelf to the left or to the right of the woman that wears a watch?"}, {"query": "What is the item of furniture to the right of the woman that is wearing trousers?"}, {"query": "Is the shelf wide or narrow?"}, {"query": "What do both the bowl and the flower have in common?"}, {"query": "Is the shelf wide and wooden?"}, {"query": "Who is wearing the pants?"}, {"query": "Who is wearing trousers?"}, {"query": "Does the woman behind the other woman seem to be sitting?"}, {"query": "Who is wearing a shirt?"}, {"query": "Do both the people have the same gender?"}, {"query": "Does the metal shelf look silver?"}, {"query": "Who is waiting?"}, {"query": "What material is the shelf made of?"}, {"query": "Is the bowl empty or full?"}, {"query": "Is the bowl black and empty?"}, {"query": "What's the shelf made of?"}]}
{"imageid": "n389007", "question": [{"query": "What size is the white logo?"}, {"query": "Is there either a fence or a racket in the picture?"}, {"query": "Is the hat white and large?"}, {"query": "Are the shorts black or white?"}, {"query": "Are there large gloves or hats?"}, {"query": "Do the tennis ball and the hat have a different colors?"}, {"query": "Do the logo and the wrist band have a different colors?"}, {"query": "Is the shirt short sleeved?"}, {"query": "Are the shorts white and short?"}, {"query": "What do the wrist band and the tennis ball have in common?"}, {"query": "In which part of the picture is the tennis ball, the bottom or the top?"}, {"query": "Is that hat white or black?"}, {"query": "What is the shape of the wristband?"}, {"query": "Is the shoe black?"}, {"query": "Is the racket to the left or to the right of the tennis ball?"}, {"query": "Is the young person holding a cell phone?"}, {"query": "Is the logo little and white?"}, {"query": "Who is the wristband worn on?"}, {"query": "Are there either any tennis balls or players in the scene?"}, {"query": "What's the man holding?"}]}
{"imageid": "n179407", "question": [{"query": "Which kind of bag is empty?"}, {"query": "Are the pens on the right of the image?"}, {"query": "Are there wallets next to the pens?"}, {"query": "What's wrapped around the ipod?"}, {"query": "Do the earphones look short?"}, {"query": "How fat is the white device?"}, {"query": "Does the book look black and thin?"}, {"query": "Which side is the wallet on?"}, {"query": "Is the book black?"}, {"query": "Is the ipod black and fat?"}, {"query": "Is the device that is not thin white or black?"}, {"query": "How long is the device on the right?"}, {"query": "Does the wallet below the purse look thin?"}, {"query": "Which side of the photo is the white device on?"}, {"query": "The wallet below the purse has what shape?"}, {"query": "Which side is the telephone on?"}, {"query": "Do you see any pens near the black wallet?"}, {"query": "Are there desks in the picture?"}, {"query": "Are there purses above the wallet that is next to the pens?"}, {"query": "Are the book and the wallet the same color?"}, {"query": "Which side is the small book on?"}, {"query": "Which kind of device are the earphones wrapped around?"}, {"query": "What are the earphones wrapped around?"}, {"query": "What devices are wrapped around the ipod?"}, {"query": "Is the empty bag in the bottom part or in the top of the picture?"}]}
{"imageid": "n513747", "question": [{"query": "Is the bag blue?"}, {"query": "Is the man standing?"}, {"query": "Is there either a train or a truck in this picture?"}, {"query": "Does the bag to the right of the woman look closed and blue?"}, {"query": "Who is looking down?"}, {"query": "What does the old person to the left of the bag wear?"}, {"query": "What is the woman doing?"}, {"query": "Does the blue bag look open?"}, {"query": "On which side of the image is the blue bag?"}, {"query": "Which place is it?"}, {"query": "Is the color of the truck different than the wheel chair?"}, {"query": "Is the old woman carrying an umbrella?"}, {"query": "Is the large truck on the left side or on the right?"}, {"query": "Is the woman looking down or reading?"}, {"query": "Is the blue bag to the right or to the left of the woman that is wearing a scarf?"}, {"query": "What does the woman wear?"}, {"query": "Do you see either bags or cars?"}, {"query": "Is there a bag to the right of the person that is wearing a scarf?"}, {"query": "Is the woman young or old?"}, {"query": "On which side is the wheel chair?"}, {"query": "What's the man doing?"}]}
{"imageid": "n428205", "question": [{"query": "What is in front of the stove that is not small?"}, {"query": "What's in front of the stove?"}, {"query": "Does the small microwave sit on a counter?"}, {"query": "What is in front of the doorway?"}, {"query": "The doorway holds what?"}, {"query": "Does the open doorway hold the high window?"}, {"query": "Is the doorway behind the island?"}, {"query": "What holds the window that is not open?"}, {"query": "What is underneath the sink?"}, {"query": "Is the large island in front of the doorway?"}, {"query": "What do you think is in front of the rectangular doorway that is holding the window?"}, {"query": "What is in front of the cabinet?"}, {"query": "Is the black stove on the left or on the right of the image?"}, {"query": "What size is that island?"}, {"query": "Does the faucet to the right of the other faucet have small size and silver color?"}, {"query": "What is common to the microwave and the stove?"}, {"query": "Are both the window frame and the island made of the same material?"}, {"query": "What is the name of the appliance that the island is in front of?"}, {"query": "Is the microwave new or old?"}, {"query": "What is the cabinet made of?"}, {"query": "Is the microwave to the right of the picture?"}, {"query": "What type of furniture is the island in front of?"}, {"query": "Is the island in front of a cabinet?"}, {"query": "What is in front of the window frame the picture is beside of?"}, {"query": "Which kind of furniture is wooden?"}, {"query": "Is the microwave old and black?"}, {"query": "Is the cabinet to the right of a stove?"}, {"query": "What is the appliance that is the same shape as the appliance that is not big called?"}, {"query": "Is the tap to the left of the other tap silver and small?"}, {"query": "What does the microwave beside the stove sit on?"}, {"query": "What does the microwave sit on?"}, {"query": "The newspaper that is sitting on the cabinet is of which color?"}, {"query": "Is the picture to the left or to the right of the appliance that is sitting on the cabinet?"}, {"query": "Which kind of furniture is strong?"}, {"query": "What kind of furniture is old?"}, {"query": "Is this a cabinet or a dining table?"}, {"query": "Does the appliance that is to the left of the cabinet have large size?"}, {"query": "What kind of furniture is to the right of the stove?"}, {"query": "Is the picture young and antique?"}, {"query": "What is located on top of the island?"}, {"query": "What shape is the sink?"}, {"query": "What kind of furniture does that microwave sit on?"}, {"query": "What kind of furniture is antique?"}, {"query": "Is the high window both small and open?"}, {"query": "Are there any glasses or clocks?"}, {"query": "What is the picture sitting on?"}, {"query": "Which kind of furniture is the picture sitting on?"}, {"query": "What is the appliance to the left of the cabinet made of wood?"}, {"query": "Which kind of furniture is behind the island?"}, {"query": "Are there any square containers or microwaves?"}, {"query": "What piece of furniture is the newspaper sitting on?"}, {"query": "What is the newspaper sitting on?"}, {"query": "Is the newspaper sitting on a dining table?"}, {"query": "What shape is the appliance that is beside the picture?"}, {"query": "Is the color of the stove different than the newspaper?"}, {"query": "Is the open window made of wood?"}, {"query": "Is the picture sitting on the cabinet that is made of wood?"}]}
{"imageid": "n390917", "question": [{"query": "Is she male?"}, {"query": "The tank top is worn on who?"}, {"query": "Is the shirt yellow and soft?"}, {"query": "Who is the shirt worn on?"}, {"query": "Who is the blue shirt worn on?"}, {"query": "Which color is the female person?"}, {"query": "Is there a red hat or scarf?"}, {"query": "Who is the tank top worn on?"}, {"query": "What is worn on the female person?"}, {"query": "Is the racket in the top part of the picture?"}, {"query": "Is the racket to the right of a girl?"}, {"query": "Who is the red hat worn on?"}, {"query": "Who is wearing the tank top?"}, {"query": "What is on the wall?"}, {"query": "Who sits behind the wall?"}, {"query": "Which color is that tank top?"}, {"query": "Is she wearing a hat?"}, {"query": "Who is wearing a hat?"}, {"query": "Who is wearing a tank top?"}, {"query": "Does the shirt have pink color?"}]}
{"imageid": "n230452", "question": [{"query": "The door in front of the building has what size?"}, {"query": "What are the fruits that the black bike is carrying called?"}, {"query": "On which side is the white bag?"}, {"query": "Are both the window and the door made of the same material?"}, {"query": "Is the black bike to the left of the woman that is carrying a purse?"}, {"query": "What is the green tree standing beside of?"}, {"query": "What is the woman pushing?"}, {"query": "The person to the right of the purse is pushing what?"}, {"query": "Are there both bikes and combs in the scene?"}, {"query": "Is there a banana to the left of the woman?"}, {"query": "Is the bike to the right or to the left of the bag that is carried by the woman?"}, {"query": "Is the tree above the steps?"}, {"query": "Is the tree that is made of wood standing beside the white building?"}, {"query": "On which side is the woman?"}, {"query": "Is the building the same color as the purse?"}, {"query": "What kind of fruit is on top of the bike?"}, {"query": "What is located on top of the bike on the road?"}, {"query": "What is located on top of the bike?"}, {"query": "Are the bananas to the left or to the right of the person that carries a purse?"}, {"query": "Is that door brown or is it green?"}, {"query": "Does the closed door look wooden and large?"}, {"query": "Is the person that is to the left of the bananas carrying an umbrella?"}, {"query": "Which color are the unripe fruits?"}, {"query": "Are the bananas on top of a skateboard?"}, {"query": "Do you see any brown purse or brief case?"}, {"query": "Who is pushing the bike to the right of the purse?"}, {"query": "What is the person that is walking doing, waiting or looking down?"}, {"query": "Do you see any men or women that are posing?"}, {"query": "What is in front of the building?"}, {"query": "What is before the building?"}, {"query": "What do both the tree and the door have in common?"}, {"query": "Is the woman to the right or to the left of the white bag?"}, {"query": "Are there both bananas and pineapples in the image?"}, {"query": "Is the road made of the same material as the building?"}, {"query": "What is pushed by the person on the left?"}, {"query": "What is pushed by the woman?"}, {"query": "The bike to the right of the purse is pushed by who?"}, {"query": "What color is the purse to the left of the bananas?"}, {"query": "What's the woman doing?"}, {"query": "Who is looking down?"}, {"query": "Are there bananas in this scene that are not ripe?"}, {"query": "What is the bike carrying?"}, {"query": "Is the road made of the same material as the bike?"}, {"query": "What is carrying the bananas?"}]}
{"imageid": "n436165", "question": [{"query": "Is the bag that looks little gray or red?"}, {"query": "What kind of furniture is to the left of the small bag?"}, {"query": "Is the computer desk to the left of the small bag?"}, {"query": "Which kind of furniture is the office filled with?"}, {"query": "What is the large office filled with?"}, {"query": "Does the rectangular door look green or brown?"}, {"query": "Is there a keyboard on the computer desk?"}, {"query": "What type of furniture is the notebook on?"}, {"query": "What's the notebook on?"}, {"query": "What kind of furniture is the notebook on?"}, {"query": "What is on the computer desk?"}, {"query": "What is the notebook on?"}, {"query": "Is there either a black briefcase or backpack?"}, {"query": "Does the backpack to the right of the office chair have large size?"}, {"query": "What is in the office that is not closed?"}, {"query": "What is the item of furniture in the office?"}, {"query": "What kind of furniture is in the office?"}, {"query": "What type of furniture is to the left of the small bag?"}, {"query": "Which size is the open office, large or small?"}, {"query": "Is the device to the left of the office chair square and gray?"}, {"query": "Which room is it?"}, {"query": "Which room could this be?"}, {"query": "Is the backpack to the right of the computer desk small and gray?"}, {"query": "Which side is the small bag on, the left or the right?"}, {"query": "What is in front of the computer desk?"}, {"query": "Is the computer desk behind an office chair?"}, {"query": "Are there girls to the left of the small bag?"}, {"query": "What kind of furniture is to the right of the computer monitor?"}, {"query": "What shape is the door?"}, {"query": "What color is the notebook which is on the computer desk?"}, {"query": "What is the item of furniture above the garbage can the office chair is to the right of?"}, {"query": "Which kind of furniture is above the trash can?"}, {"query": "Which kind of device is sitting atop the computer desk?"}, {"query": "What is sitting atop the computer desk?"}, {"query": "What type of furniture is the computer monitor to the left of the office chair sitting atop?"}, {"query": "What is the device that is to the left of the office chair sitting atop?"}, {"query": "What is the computer monitor sitting atop?"}, {"query": "Which kind of furniture is the computer monitor sitting atop?"}, {"query": "What is the device that is to the left of the office chair that is to the left of the backpack?"}, {"query": "Is the garbage can under the computer desk behind the office chair?"}, {"query": "What is under the computer desk?"}, {"query": "Which kind of furniture is to the left of the backpack?"}, {"query": "Which kind of furniture isn't wooden?"}, {"query": "What is the piece of furniture that is not wooden called?"}, {"query": "Which kind of furniture is wooden?"}, {"query": "What kind of furniture is made of wood?"}, {"query": "Which kind of furniture is not wooden, the office chair or the computer desk?"}, {"query": "What is in front of the computer desk the notebook is on?"}, {"query": "Are there sinks above the trash bin?"}, {"query": "Is the office filled with computer desk?"}, {"query": "What is filled with computer desk?"}, {"query": "On which side of the image is the trash bin?"}, {"query": "Which color is the trash bin?"}]}
{"imageid": "n285154", "question": [{"query": "Which size is the hat, small or large?"}, {"query": "Who is wearing the shoes?"}, {"query": "What's the boy wearing?"}, {"query": "Is the person on top of the skateboard skinny and old?"}, {"query": "Who is wearing shoes?"}, {"query": "What color do you think the ceiling is?"}, {"query": "Are there either large hats or gloves in this image?"}, {"query": "What color do you think the small hat is?"}, {"query": "Is the floor below the steps the pole is next to?"}, {"query": "Which color are the trousers, dark or khaki?"}, {"query": "What length is the jacket?"}, {"query": "Does the hat look small and dark?"}]}
{"imageid": "n112552", "question": [{"query": "Are there any dogs or giraffes?"}, {"query": "Which kind of animal is sitting atop the snow?"}, {"query": "What is the dog to the left of the bench sitting atop?"}, {"query": "What type of animal is sitting atop the snow?"}, {"query": "What animal are the kids looking at?"}, {"query": "Who is looking at the dog?"}, {"query": "Who is looking at the animal that is sitting atop the snow?"}, {"query": "What kind of animal are the children looking at?"}, {"query": "Does the bench to the right of the dog look huge and stone?"}, {"query": "What are the trees covered by?"}, {"query": "Does the bench to the right of the dog have small size?"}, {"query": "How large is the animal the kids are looking at?"}, {"query": "What does the bench to the right of the dog sit atop?"}, {"query": "Are the kids in the bottom or in the top?"}]}
{"imageid": "n274309", "question": [{"query": "What gender do you think the person is?"}, {"query": "Do you think the female person is Caucasian or Asian?"}, {"query": "Are the books on the left side?"}, {"query": "Is the female person wearing a glove?"}, {"query": "How long is the hair?"}, {"query": "What is located on top of the wood table?"}, {"query": "What is the mirror next to the wall made of?"}, {"query": "What is the person sleeping on?"}, {"query": "The female person is sleeping on what?"}, {"query": "Which kind of furniture is the person sleeping on?"}, {"query": "Are there curtains or beds in the picture?"}, {"query": "What is located on top of the table?"}, {"query": "Which kind of clothing is tight?"}, {"query": "Which kind of clothing is red?"}, {"query": "What is the person doing?"}, {"query": "Are there either any cabinets or mirrors that are not tall?"}, {"query": "Is the window light and clear?"}, {"query": "What type of clothing is tight?"}, {"query": "Is her hair black and long?"}, {"query": "What color do you think her hair is?"}, {"query": "Is the person that is sleeping Caucasian and male?"}]}
{"imageid": "n148851", "question": [{"query": "What is in front of the chair that is to the right of the lamp?"}, {"query": "What is the table in front of?"}, {"query": "Is the chair that is to the right of the lamp both red and hard?"}, {"query": "Does the red chair seem to be soft?"}, {"query": "How fat is the lamp the picture is behind of?"}, {"query": "Is the lamp behind the person on or off?"}, {"query": "Do you see any chairs on the floor?"}, {"query": "What kind of furniture is on the floor?"}, {"query": "Does the small table in front of the chair look round?"}, {"query": "Do you see either any lamps or faucets that are off?"}, {"query": "Is the red chair to the left of a lamp?"}, {"query": "Do you see any lamps in front of the picture that is hanging from the wall?"}, {"query": "Are there beds behind the person on the left?"}, {"query": "Is the person to the right of the other person old and female?"}, {"query": "Which kind of furniture is behind the table?"}, {"query": "Is the red chair to the right or to the left of the person that is not female?"}, {"query": "Is there a pillow to the left of the lamp in the center of the image?"}, {"query": "What kind of furniture is to the right of the person that is in front of the lamp?"}, {"query": "Is the table on the floor both brown and small?"}, {"query": "Is there a small table or cabinet?"}, {"query": "Is the floor gray and soft?"}, {"query": "What piece of furniture is on the floor?"}, {"query": "What shape is the picture behind the lamp?"}, {"query": "How is the piece of furniture behind the person that is standing on the floor called?"}, {"query": "Do you see any lamps or figurines in this picture?"}, {"query": "Does the chair to the left of the lamp appear to be brown and soft?"}, {"query": "Is the rectangular picture to the left or to the right of the person in the center?"}, {"query": "Is the hard chair in front or behind the table on the floor?"}, {"query": "Is the red chair behind the table that is on the floor?"}, {"query": "How fat is the lamp to the left of the chair?"}, {"query": "Does the lamp that is to the left of the chair look skinny and short?"}, {"query": "Is the rectangular picture on the right side?"}]}
{"imageid": "n482670", "question": [{"query": "What is in front of the palm trees on the right?"}, {"query": "What's in front of the palm trees?"}, {"query": "What is in front of the shallow water?"}, {"query": "On which side of the image are the green trees?"}, {"query": "Are the palms behind the boulders tall and green?"}, {"query": "Do you see any dogs or fences there?"}, {"query": "Is the tail long and black?"}, {"query": "What color is the long tail, white or brown?"}, {"query": "Does the choppy water look shallow and dark blue?"}, {"query": "Are there horses on the sandy beach?"}, {"query": "What is the animal that is behind the clear water?"}, {"query": "Is the water in front of the dog dirty and calm?"}, {"query": "What is in front of the shrubs?"}, {"query": "What is in front of the bushes?"}, {"query": "The water that the boulders are in front of is of what color?"}, {"query": "Is the clean water behind a dog?"}, {"query": "What is in front of the animal on the beach?"}]}
{"imageid": "n334579", "question": [{"query": "Does the frisbee to the left of the man look green or white?"}, {"query": "How old is the man that is running?"}, {"query": "Does the shirt look black and short sleeved?"}, {"query": "What color is the short sleeved shirt which is worn on the man?"}, {"query": "Is the frisbee to the left or to the right of the man that is running?"}, {"query": "Does the shirt seem to be short sleeved?"}, {"query": "What is the man that is to the left of the frisbee wearing?"}, {"query": "Who do you think is in front of the window?"}, {"query": "Who is running?"}]}
{"imageid": "n96980", "question": [{"query": "Who is playing?"}, {"query": "Are the trees behind a train?"}, {"query": "Do you think the trees are clear?"}, {"query": "Do the trees behind the fence look brown and clear?"}, {"query": "Who wears the shoes?"}, {"query": "What is the Caucasian man doing?"}, {"query": "Is the shirt short sleeved or sleeveless?"}, {"query": "Is the iron fence in front of the green trees?"}, {"query": "How clean is that ground?"}, {"query": "Does the ground look clean and clear?"}, {"query": "Which race do you think the man is?"}, {"query": "Is the shirt red and short sleeved?"}, {"query": "What color is the shirt?"}, {"query": "Where is the man standing on?"}, {"query": "The person that is to the right of the tennis racket is standing where?"}, {"query": "Is the racket to the left or to the right of the man?"}, {"query": "What is used to make the fence, iron or concrete?"}, {"query": "What is in front of the trees?"}, {"query": "What is the fence in front of?"}, {"query": "Do you think the shoes are blue?"}, {"query": "What is the color of the racket?"}]}
{"imageid": "n8526", "question": [{"query": "What's he doing?"}, {"query": "Is the color of the hat different than the color of the jacket?"}, {"query": "What are the umbrellas made of?"}, {"query": "Do you see any umbrellas there that are not made of plastic?"}, {"query": "Is that jacket black and large?"}, {"query": "Is the black jacket large or small?"}, {"query": "Which side are the umbrellas on?"}, {"query": "Which kind of clothing is large?"}, {"query": "Is the hat soft and blue?"}, {"query": "Are the colorful umbrellas above the crowd that is behind the man?"}, {"query": "Who is wearing the hat?"}, {"query": "Is the person in front of the crowd wearing a hat?"}, {"query": "Is the ground hard and white?"}, {"query": "Are there umbrellas or surfboards in this image?"}, {"query": "Who is the man in front of?"}, {"query": "Who is he in front of?"}, {"query": "Is the sky white and cloudy?"}, {"query": "Is the crowd below the umbrellas?"}, {"query": "Does the ground seem to be brown?"}]}
{"imageid": "n289541", "question": [{"query": "Are both these people female?"}, {"query": "Are both the suitcase and the shirt the same color?"}, {"query": "Who is the girl sitting next to?"}, {"query": "Who is wearing the shirt?"}, {"query": "What does the woman that to the right of the suitcase sit on?"}, {"query": "Are there women to the left of the suitcase?"}, {"query": "Do both the skirt and the undershirt look blue?"}, {"query": "Does the skirt have a different color than the cigarette?"}, {"query": "What does the woman sit on?"}, {"query": "What color do you think the skirt is?"}, {"query": "What color is the suitcase to the left of the glasses?"}, {"query": "Does the undershirt look blue?"}, {"query": "What is the woman doing?"}, {"query": "Who is sitting?"}, {"query": "Who is wearing a shirt?"}, {"query": "Who is wearing a suitcase?"}, {"query": "Who is wearing the suitcase?"}, {"query": "Which color is the shoe, blue or brown?"}, {"query": "Is there either a ball or a helmet in this scene?"}, {"query": "Who is wearing a shoe?"}, {"query": "Who is wearing the shoe?"}, {"query": "What's the girl doing?"}, {"query": "Are there any women or men that are not sitting?"}, {"query": "What color is the shirt?"}, {"query": "What does the person to the left of the cigarette sit on?"}, {"query": "What does the girl sit on?"}, {"query": "What is the girl to the left of the cigarette wearing?"}, {"query": "Is the blue suitcase to the left of the glasses?"}]}
{"imageid": "n491454", "question": [{"query": "Which kind of vehicle is below the sky?"}, {"query": "What is the vehicle that is below the sky?"}, {"query": "Which kind of vehicle is on the field?"}, {"query": "Where is the truck?"}, {"query": "Are the rubber tires black and round?"}, {"query": "The light bulbs that are made of glass have what shape?"}, {"query": "What is the truck made of?"}, {"query": "Is this truck metallic and red?"}, {"query": "What is on the field in this photo?"}, {"query": "Does the sky look blue and bright?"}, {"query": "Which kind of vehicle is made of metal?"}, {"query": "Which place is it?"}, {"query": "Does the metal vehicle appear to be white?"}, {"query": "Does the field look brown and small?"}, {"query": "What color is the field that is not little?"}, {"query": "What kind of furniture is below the sky?"}, {"query": "Are there any pizza slices or carts?"}, {"query": "What's on the field?"}, {"query": "What type of furniture is below the sky?"}, {"query": "Of what color is the bed the sky is above?"}]}
{"imageid": "n193248", "question": [{"query": "Which kind of fast food is to the right of the person?"}, {"query": "Do the hot dogs to the right of the person look raw and pink?"}, {"query": "Is the hot dog that is to the left of the other hot dog pink and cooked?"}, {"query": "What food is the person holding onto?"}, {"query": "What food is he holding onto?"}, {"query": "What is he holding onto?"}, {"query": "What is the person holding onto?"}, {"query": "Does he wear jeans?"}, {"query": "Does he look Asian and male?"}, {"query": "Does the shirt have red color?"}, {"query": "What clothing item is worn?"}, {"query": "What kind of fast food is on the grill?"}, {"query": "What kind of fast food is on the grill that the person is standing next to?"}, {"query": "Is the hot dog that is to the left of the other hot dog raw or cooked?"}]}
